espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_SRAM_CMD_REG register
 *  SPI0 external RAM mode control register
 */
#define SPI_MEM_C_SRAM_CMD_REG (DR_REG_FLASH_SPI0_BASE + 0x44)
/** SPI_MEM_C_SCLK_MODE : HRO; bitpos: [1:0]; default: 0;
 *  SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delayed
 *  one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inactive 3:
 *  SPI clock is always on.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SCLK_MODE    0x00000003U
#define SPI_MEM_C_SCLK_MODE_M  (SPI_MEM_C_SCLK_MODE_V << SPI_MEM_C_SCLK_MODE_S)
#define SPI_MEM_C_SCLK_MODE_V  0x00000003U
#define SPI_MEM_C_SCLK_MODE_S  0
/** SPI_MEM_C_SWB_MODE : HRO; bitpos: [9:2]; default: 0;
 *  Mode bits in the external RAM fast read mode  it is combined with
 *  spi_mem_fastrd_mode bit.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SWB_MODE    0x000000FFU
#define SPI_MEM_C_SWB_MODE_M  (SPI_MEM_C_SWB_MODE_V << SPI_MEM_C_SWB_MODE_S)
#define SPI_MEM_C_SWB_MODE_V  0x000000FFU
#define SPI_MEM_C_SWB_MODE_S  2
/** SPI_MEM_C_SDIN_DUAL : HRO; bitpos: [10]; default: 0;
 *  For SPI0 external RAM , din phase apply 2 signals. 1: enable 0: disable. The bit is
 *  the same with spi_mem_usr_sram_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SDIN_DUAL    (BIT(10))
#define SPI_MEM_C_SDIN_DUAL_M  (SPI_MEM_C_SDIN_DUAL_V << SPI_MEM_C_SDIN_DUAL_S)
#define SPI_MEM_C_SDIN_DUAL_V  0x00000001U
#define SPI_MEM_C_SDIN_DUAL_S  10
/** SPI_MEM_C_SDOUT_DUAL : HRO; bitpos: [11]; default: 0;
 *  For SPI0 external RAM , dout phase apply 2 signals. 1: enable 0: disable. The bit
 *  is the same with spi_mem_usr_sram_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SDOUT_DUAL    (BIT(11))
#define SPI_MEM_C_SDOUT_DUAL_M  (SPI_MEM_C_SDOUT_DUAL_V << SPI_MEM_C_SDOUT_DUAL_S)
#define SPI_MEM_C_SDOUT_DUAL_V  0x00000001U
#define SPI_MEM_C_SDOUT_DUAL_S  11
/** SPI_MEM_C_SADDR_DUAL : HRO; bitpos: [12]; default: 0;
 *  For SPI0 external RAM , address phase apply 2 signals. 1: enable 0: disable. The
 *  bit is the same with spi_mem_usr_sram_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SADDR_DUAL    (BIT(12))
#define SPI_MEM_C_SADDR_DUAL_M  (SPI_MEM_C_SADDR_DUAL_V << SPI_MEM_C_SADDR_DUAL_S)
#define SPI_MEM_C_SADDR_DUAL_V  0x00000001U
#define SPI_MEM_C_SADDR_DUAL_S  12
/** SPI_MEM_C_SDIN_QUAD : HRO; bitpos: [14]; default: 0;
 *  For SPI0 external RAM , din phase apply 4 signals. 1: enable 0: disable. The bit is
 *  the same with spi_mem_usr_sram_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SDIN_QUAD    (BIT(14))
#define SPI_MEM_C_SDIN_QUAD_M  (SPI_MEM_C_SDIN_QUAD_V << SPI_MEM_C_SDIN_QUAD_S)
#define SPI_MEM_C_SDIN_QUAD_V  0x00000001U
#define SPI_MEM_C_SDIN_QUAD_S  14
/** SPI_MEM_C_SDOUT_QUAD : HRO; bitpos: [15]; default: 0;
 *  For SPI0 external RAM , dout phase apply 4 signals. 1: enable 0: disable. The bit
 *  is the same with spi_mem_usr_sram_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SDOUT_QUAD    (BIT(15))
#define SPI_MEM_C_SDOUT_QUAD_M  (SPI_MEM_C_SDOUT_QUAD_V << SPI_MEM_C_SDOUT_QUAD_S)
#define SPI_MEM_C_SDOUT_QUAD_V  0x00000001U
#define SPI_MEM_C_SDOUT_QUAD_S  15
/** SPI_MEM_C_SADDR_QUAD : HRO; bitpos: [16]; default: 0;
 *  For SPI0 external RAM , address phase apply 4 signals. 1: enable 0: disable. The
 *  bit is the same with spi_mem_usr_sram_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SADDR_QUAD    (BIT(16))
#define SPI_MEM_C_SADDR_QUAD_M  (SPI_MEM_C_SADDR_QUAD_V << SPI_MEM_C_SADDR_QUAD_S)
#define SPI_MEM_C_SADDR_QUAD_V  0x00000001U
#define SPI_MEM_C_SADDR_QUAD_S  16
/** SPI_MEM_C_SCMD_QUAD : HRO; bitpos: [17]; default: 0;
 *  For SPI0 external RAM , cmd phase apply 4 signals. 1: enable 0: disable. The bit is
 *  the same with spi_mem_usr_sram_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SCMD_QUAD    (BIT(17))
#define SPI_MEM_C_SCMD_QUAD_M  (SPI_MEM_C_SCMD_QUAD_V << SPI_MEM_C_SCMD_QUAD_S)
#define SPI_MEM_C_SCMD_QUAD_V  0x00000001U
#define SPI_MEM_C_SCMD_QUAD_S  17
/** SPI_MEM_C_SDIN_OCT : HRO; bitpos: [18]; default: 0;
 *  For SPI0 external RAM , din phase apply 8 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SDIN_OCT    (BIT(18))
#define SPI_MEM_C_SDIN_OCT_M  (SPI_MEM_C_SDIN_OCT_V << SPI_MEM_C_SDIN_OCT_S)
#define SPI_MEM_C_SDIN_OCT_V  0x00000001U
#define SPI_MEM_C_SDIN_OCT_S  18
/** SPI_MEM_C_SDOUT_OCT : HRO; bitpos: [19]; default: 0;
 *  For SPI0 external RAM , dout phase apply 8 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SDOUT_OCT    (BIT(19))
#define SPI_MEM_C_SDOUT_OCT_M  (SPI_MEM_C_SDOUT_OCT_V << SPI_MEM_C_SDOUT_OCT_S)
#define SPI_MEM_C_SDOUT_OCT_V  0x00000001U
#define SPI_MEM_C_SDOUT_OCT_S  19
/** SPI_MEM_C_SADDR_OCT : HRO; bitpos: [20]; default: 0;
 *  For SPI0 external RAM , address phase apply 4 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SADDR_OCT    (BIT(20))
#define SPI_MEM_C_SADDR_OCT_M  (SPI_MEM_C_SADDR_OCT_V << SPI_MEM_C_SADDR_OCT_S)
#define SPI_MEM_C_SADDR_OCT_V  0x00000001U
#define SPI_MEM_C_SADDR_OCT_S  20
/** SPI_MEM_C_SCMD_OCT : HRO; bitpos: [21]; default: 0;
 *  For SPI0 external RAM , cmd phase apply 8 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SCMD_OCT    (BIT(21))
#define SPI_MEM_C_SCMD_OCT_M  (SPI_MEM_C_SCMD_OCT_V << SPI_MEM_C_SCMD_OCT_S)
#define SPI_MEM_C_SCMD_OCT_V  0x00000001U
#define SPI_MEM_C_SCMD_OCT_S  21
/** SPI_MEM_C_SDUMMY_RIN : R/W; bitpos: [22]; default: 1;
 *  In the dummy phase of a MSPI read data transfer when accesses to external RAM, the
 *  signal level of SPI bus is output by the MSPI controller.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SDUMMY_RIN    (BIT(22))
#define SPI_MEM_C_SDUMMY_RIN_M  (SPI_MEM_C_SDUMMY_RIN_V << SPI_MEM_C_SDUMMY_RIN_S)
#define SPI_MEM_C_SDUMMY_RIN_V  0x00000001U
#define SPI_MEM_C_SDUMMY_RIN_S  22
/** SPI_MEM_C_SDUMMY_WOUT : HRO; bitpos: [23]; default: 0;
 *  In the dummy phase of a MSPI write data transfer when accesses to external RAM, the
 *  signal level of SPI bus is output by the MSPI controller.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SDUMMY_WOUT    (BIT(23))
#define SPI_MEM_C_SDUMMY_WOUT_M  (SPI_MEM_C_SDUMMY_WOUT_V << SPI_MEM_C_SDUMMY_WOUT_S)
#define SPI_MEM_C_SDUMMY_WOUT_V  0x00000001U
#define SPI_MEM_C_SDUMMY_WOUT_S  23
/** SPI_SMEM_C_WDUMMY_DQS_ALWAYS_OUT : HRO; bitpos: [24]; default: 0;
 *  In the dummy phase of an MSPI write data transfer when accesses to external RAM,
 *  the level of SPI_DQS is output by the MSPI controller.
 */
#define SPI_SMEM_C_WDUMMY_DQS_ALWAYS_OUT    (BIT(24))
#define SPI_SMEM_C_WDUMMY_DQS_ALWAYS_OUT_M  (SPI_SMEM_C_WDUMMY_DQS_ALWAYS_OUT_V << SPI_SMEM_C_WDUMMY_DQS_ALWAYS_OUT_S)
#define SPI_SMEM_C_WDUMMY_DQS_ALWAYS_OUT_V  0x00000001U
#define SPI_SMEM_C_WDUMMY_DQS_ALWAYS_OUT_S  24
/** SPI_SMEM_C_WDUMMY_ALWAYS_OUT : HRO; bitpos: [25]; default: 0;
 *  In the dummy phase of an MSPI write data transfer when accesses to external RAM,
 *  the level of SPI_IO[7:0] is output by the MSPI controller.
 */
#define SPI_SMEM_C_WDUMMY_ALWAYS_OUT    (BIT(25))
#define SPI_SMEM_C_WDUMMY_ALWAYS_OUT_M  (SPI_SMEM_C_WDUMMY_ALWAYS_OUT_V << SPI_SMEM_C_WDUMMY_ALWAYS_OUT_S)
#define SPI_SMEM_C_WDUMMY_ALWAYS_OUT_V  0x00000001U
#define SPI_SMEM_C_WDUMMY_ALWAYS_OUT_S  25
/** SPI_SMEM_C_DQS_IE_ALWAYS_ON : HRO; bitpos: [30]; default: 1;
 *  When accesses to external RAM, 1: the IE signals of pads connected to SPI_DQS are
 *  always 1. 0: Others.
 */
#define SPI_SMEM_C_DQS_IE_ALWAYS_ON    (BIT(30))
#define SPI_SMEM_C_DQS_IE_ALWAYS_ON_M  (SPI_SMEM_C_DQS_IE_ALWAYS_ON_V << SPI_SMEM_C_DQS_IE_ALWAYS_ON_S)
#define SPI_SMEM_C_DQS_IE_ALWAYS_ON_V  0x00000001U
#define SPI_SMEM_C_DQS_IE_ALWAYS_ON_S  30
/** SPI_SMEM_C_DATA_IE_ALWAYS_ON : HRO; bitpos: [31]; default: 1;
 *  When accesses to external RAM, 1: the IE signals of pads connected to SPI_IO[7:0]
 *  are always 1. 0: Others.
 */
#define SPI_SMEM_C_DATA_IE_ALWAYS_ON    (BIT(31))
#define SPI_SMEM_C_DATA_IE_ALWAYS_ON_M  (SPI_SMEM_C_DATA_IE_ALWAYS_ON_V << SPI_SMEM_C_DATA_IE_ALWAYS_ON_S)
#define SPI_SMEM_C_DATA_IE_ALWAYS_ON_V  0x00000001U
#define SPI_SMEM_C_DATA_IE_ALWAYS_ON_S  31

/** SPI_MEM_C_SRAM_DRD_CMD_REG register
 *  SPI0 external RAM DDR read command control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_C_SRAM_DRD_CMD_REG (DR_REG_FLASH_SPI0_BASE + 0x48)
/** SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_VALUE : HRO; bitpos: [15:0]; default: 0;
 *  For SPI0,When cache mode is enable it is the read command value of command phase
 *  for sram.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_VALUE    0x0000FFFFU
#define SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_VALUE_M  (SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_VALUE_V << SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_VALUE_S)
#define SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_VALUE_V  0x0000FFFFU
#define SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_VALUE_S  0
/** SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_BITLEN : HRO; bitpos: [31:28]; default: 0;
 *  For SPI0,When cache mode is enable it is the length in bits of command phase for
 *  sram. The register value shall be (bit_num-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_BITLEN    0x0000000FU
#define SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_BITLEN_M  (SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_BITLEN_V << SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_BITLEN_S)
#define SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_BITLEN_V  0x0000000FU
#define SPI_MEM_C_CACHE_SRAM_USR_RD_CMD_BITLEN_S  28

/** SPI_MEM_C_SRAM_DWR_CMD_REG register
 *  SPI0 external RAM DDR write command control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_C_SRAM_DWR_CMD_REG (DR_REG_FLASH_SPI0_BASE + 0x4c)
/** SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_VALUE : HRO; bitpos: [15:0]; default: 0;
 *  For SPI0,When cache mode is enable it is the write command value of command phase
 *  for sram.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_VALUE    0x0000FFFFU
#define SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_VALUE_M  (SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_VALUE_V << SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_VALUE_S)
#define SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_VALUE_V  0x0000FFFFU
#define SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_VALUE_S  0
/** SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_BITLEN : HRO; bitpos: [31:28]; default: 0;
 *  For SPI0,When cache mode is enable it is the in bits of command phase  for sram.
 *  The register value shall be (bit_num-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_BITLEN    0x0000000FU
#define SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_BITLEN_M  (SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_BITLEN_V << SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_BITLEN_S)
#define SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_BITLEN_V  0x0000000FU
#define SPI_MEM_C_CACHE_SRAM_USR_WR_CMD_BITLEN_S  28

/** SPI_MEM_C_SRAM_CLK_REG register
 *  SPI0 external RAM clock control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_C_SRAM_CLK_REG (DR_REG_FLASH_SPI0_BASE + 0x50)
/** SPI_MEM_C_SCLKCNT_L : HRO; bitpos: [7:0]; default: 3;
 *  For SPI0 external RAM  interface, it must be equal to SPI_MEM_C_SCLKCNT_N.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SCLKCNT_L    0x000000FFU
#define SPI_MEM_C_SCLKCNT_L_M  (SPI_MEM_C_SCLKCNT_L_V << SPI_MEM_C_SCLKCNT_L_S)
#define SPI_MEM_C_SCLKCNT_L_V  0x000000FFU
#define SPI_MEM_C_SCLKCNT_L_S  0
/** SPI_MEM_C_SCLKCNT_H : HRO; bitpos: [15:8]; default: 1;
 *  For SPI0 external RAM  interface, it must be floor((SPI_MEM_C_SCLKCNT_N+1)/2-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SCLKCNT_H    0x000000FFU
#define SPI_MEM_C_SCLKCNT_H_M  (SPI_MEM_C_SCLKCNT_H_V << SPI_MEM_C_SCLKCNT_H_S)
#define SPI_MEM_C_SCLKCNT_H_V  0x000000FFU
#define SPI_MEM_C_SCLKCNT_H_S  8
/** SPI_MEM_C_SCLKCNT_N : HRO; bitpos: [23:16]; default: 3;
 *  For SPI0 external RAM  interface, it is the divider of spi_mem_clk. So spi_mem_clk
 *  frequency is system/(SPI_MEM_C_SCLKCNT_N+1)
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SCLKCNT_N    0x000000FFU
#define SPI_MEM_C_SCLKCNT_N_M  (SPI_MEM_C_SCLKCNT_N_V << SPI_MEM_C_SCLKCNT_N_S)
#define SPI_MEM_C_SCLKCNT_N_V  0x000000FFU
#define SPI_MEM_C_SCLKCNT_N_S  16
/** SPI_MEM_C_SCLK_EQU_SYSCLK : HRO; bitpos: [31]; default: 0;
 *  For SPI0 external RAM  interface, 1: spi_mem_clk is equal to system 0: spi_mem_clk
 *  is divided from system clock.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SCLK_EQU_SYSCLK    (BIT(31))
#define SPI_MEM_C_SCLK_EQU_SYSCLK_M  (SPI_MEM_C_SCLK_EQU_SYSCLK_V << SPI_MEM_C_SCLK_EQU_SYSCLK_S)
#define SPI_MEM_C_SCLK_EQU_SYSCLK_V  0x00000001U
#define SPI_MEM_C_SCLK_EQU_SYSCLK_S  31

/** SPI_MEM_C_FSM_REG register
 *  SPI0 FSM status register
 */
#define SPI_MEM_C_FSM_REG (DR_REG_FLASH_SPI0_BASE + 0x54)
/** SPI_MEM_C_LOCK_DELAY_TIME : R/W; bitpos: [18:7]; default: 4;
 *  The lock delay time of SPI0/1 arbiter by spi0_slv_st, after PER is sent by SPI1.
 */
#define SPI_MEM_C_LOCK_DELAY_TIME    0x00000FFFU
#define SPI_MEM_C_LOCK_DELAY_TIME_M  (SPI_MEM_C_LOCK_DELAY_TIME_V << SPI_MEM_C_LOCK_DELAY_TIME_S)
#define SPI_MEM_C_LOCK_DELAY_TIME_V  0x00000FFFU
#define SPI_MEM_C_LOCK_DELAY_TIME_S  7
/** SPI_MEM_C_FLASH_LOCK_EN : R/W; bitpos: [19]; default: 0;
 *  The lock enable for FLASH to lock spi0 trans req.1: Enable. 0: Disable.
 */
#define SPI_MEM_C_FLASH_LOCK_EN    (BIT(19))
#define SPI_MEM_C_FLASH_LOCK_EN_M  (SPI_MEM_C_FLASH_LOCK_EN_V << SPI_MEM_C_FLASH_LOCK_EN_S)
#define SPI_MEM_C_FLASH_LOCK_EN_V  0x00000001U
#define SPI_MEM_C_FLASH_LOCK_EN_S  19
/** SPI_MEM_C_SRAM_LOCK_EN : R/W; bitpos: [20]; default: 0;
 *  The lock enable for external RAM to lock spi0 trans req.1: Enable. 0: Disable.
 */
#define SPI_MEM_C_SRAM_LOCK_EN    (BIT(20))
#define SPI_MEM_C_SRAM_LOCK_EN_M  (SPI_MEM_C_SRAM_LOCK_EN_V << SPI_MEM_C_SRAM_LOCK_EN_S)
#define SPI_MEM_C_SRAM_LOCK_EN_V  0x00000001U
#define SPI_MEM_C_SRAM_LOCK_EN_S  20

/** SPI_MEM_C_INT_ENA_REG register
 *  SPI0 interrupt enable register
 */
#define SPI_MEM_C_INT_ENA_REG (DR_REG_FLASH_SPI0_BASE + 0xc0)
/** SPI_MEM_C_SLV_ST_END_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The enable bit for SPI_MEM_C_SLV_ST_END_INT interrupt.
 */
#define SPI_MEM_C_SLV_ST_END_INT_ENA    (BIT(3))
#define SPI_MEM_C_SLV_ST_END_INT_ENA_M  (SPI_MEM_C_SLV_ST_END_INT_ENA_V << SPI_MEM_C_SLV_ST_END_INT_ENA_S)
#define SPI_MEM_C_SLV_ST_END_INT_ENA_V  0x00000001U
#define SPI_MEM_C_SLV_ST_END_INT_ENA_S  3
/** SPI_MEM_C_MST_ST_END_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The enable bit for SPI_MEM_C_MST_ST_END_INT interrupt.
 */
#define SPI_MEM_C_MST_ST_END_INT_ENA    (BIT(4))
#define SPI_MEM_C_MST_ST_END_INT_ENA_M  (SPI_MEM_C_MST_ST_END_INT_ENA_V << SPI_MEM_C_MST_ST_END_INT_ENA_S)
#define SPI_MEM_C_MST_ST_END_INT_ENA_V  0x00000001U
#define SPI_MEM_C_MST_ST_END_INT_ENA_S  4
/** SPI_MEM_C_ECC_ERR_INT_ENA : HRO; bitpos: [5]; default: 0;
 *  The enable bit for SPI_MEM_C_ECC_ERR_INT interrupt.
 */
#define SPI_MEM_C_ECC_ERR_INT_ENA    (BIT(5))
#define SPI_MEM_C_ECC_ERR_INT_ENA_M  (SPI_MEM_C_ECC_ERR_INT_ENA_V << SPI_MEM_C_ECC_ERR_INT_ENA_S)
#define SPI_MEM_C_ECC_ERR_INT_ENA_V  0x00000001U
#define SPI_MEM_C_ECC_ERR_INT_ENA_S  5
/** SPI_MEM_C_PMS_REJECT_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The enable bit for SPI_MEM_C_PMS_REJECT_INT interrupt.
 */
#define SPI_MEM_C_PMS_REJECT_INT_ENA    (BIT(6))
#define SPI_MEM_C_PMS_REJECT_INT_ENA_M  (SPI_MEM_C_PMS_REJECT_INT_ENA_V << SPI_MEM_C_PMS_REJECT_INT_ENA_S)
#define SPI_MEM_C_PMS_REJECT_INT_ENA_V  0x00000001U
#define SPI_MEM_C_PMS_REJECT_INT_ENA_S  6
/** SPI_MEM_C_AXI_RADDR_ERR_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The enable bit for SPI_MEM_C_AXI_RADDR_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_RADDR_ERR_INT_ENA    (BIT(7))
#define SPI_MEM_C_AXI_RADDR_ERR_INT_ENA_M  (SPI_MEM_C_AXI_RADDR_ERR_INT_ENA_V << SPI_MEM_C_AXI_RADDR_ERR_INT_ENA_S)
#define SPI_MEM_C_AXI_RADDR_ERR_INT_ENA_V  0x00000001U
#define SPI_MEM_C_AXI_RADDR_ERR_INT_ENA_S  7
/** SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The enable bit for SPI_MEM_C_AXI_WR_FALSH_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ENA    (BIT(8))
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ENA_M  (SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ENA_V << SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ENA_S)
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ENA_V  0x00000001U
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ENA_S  8
/** SPI_MEM_C_AXI_WADDR_ERR_INT__ENA : R/W; bitpos: [9]; default: 0;
 *  The enable bit for SPI_MEM_C_AXI_WADDR_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_WADDR_ERR_INT__ENA    (BIT(9))
#define SPI_MEM_C_AXI_WADDR_ERR_INT__ENA_M  (SPI_MEM_C_AXI_WADDR_ERR_INT__ENA_V << SPI_MEM_C_AXI_WADDR_ERR_INT__ENA_S)
#define SPI_MEM_C_AXI_WADDR_ERR_INT__ENA_V  0x00000001U
#define SPI_MEM_C_AXI_WADDR_ERR_INT__ENA_S  9
/** SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The enable bit for SPI_MEM_C_NANDFLASH_PE_FAIL_INT interrupt.
 */
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ENA    (BIT(11))
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ENA_M  (SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ENA_V << SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ENA_S)
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ENA_V  0x00000001U
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ENA_S  11
/** SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The enable bit for SPI_MEM_C_NANDFLASH_ECC_ERR_INT interrupt.
 */
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ENA    (BIT(12))
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ENA_M  (SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ENA_V << SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ENA_S)
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ENA_V  0x00000001U
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ENA_S  12
/** SPI_MEM_C_XTS_FAULT_DETECTED_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  The enable  bit for SPI_MEM_C_XTS_FAULT_DETECTED_INT interrupt.
 */
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_ENA    (BIT(13))
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_ENA_M  (SPI_MEM_C_XTS_FAULT_DETECTED_INT_ENA_V << SPI_MEM_C_XTS_FAULT_DETECTED_INT_ENA_S)
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_ENA_V  0x00000001U
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_ENA_S  13
/** SPI_MEM_C_RX_TRANS_OVF_INT_ENA : HRO; bitpos: [26]; default: 0;
 *  The enable bit for SPI_MEM_C_RX_TRANS_OVF_INT interrupt.
 */
#define SPI_MEM_C_RX_TRANS_OVF_INT_ENA    (BIT(26))
#define SPI_MEM_C_RX_TRANS_OVF_INT_ENA_M  (SPI_MEM_C_RX_TRANS_OVF_INT_ENA_V << SPI_MEM_C_RX_TRANS_OVF_INT_ENA_S)
#define SPI_MEM_C_RX_TRANS_OVF_INT_ENA_V  0x00000001U
#define SPI_MEM_C_RX_TRANS_OVF_INT_ENA_S  26
/** SPI_MEM_C_TX_TRANS_UDF_INT_ENA : HRO; bitpos: [27]; default: 0;
 *  The enable bit for SPI_MEM_C_TX_TRANS_UDF_INT interrupt.
 */
#define SPI_MEM_C_TX_TRANS_UDF_INT_ENA    (BIT(27))
#define SPI_MEM_C_TX_TRANS_UDF_INT_ENA_M  (SPI_MEM_C_TX_TRANS_UDF_INT_ENA_V << SPI_MEM_C_TX_TRANS_UDF_INT_ENA_S)
#define SPI_MEM_C_TX_TRANS_UDF_INT_ENA_V  0x00000001U
#define SPI_MEM_C_TX_TRANS_UDF_INT_ENA_S  27

