espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_INT_CLR_REG register
 *  SPI0 interrupt clear register
 */
#define SPI_MEM_C_INT_CLR_REG (DR_REG_FLASH_SPI0_BASE + 0xc4)
/** SPI_MEM_C_SLV_ST_END_INT_CLR : WT; bitpos: [3]; default: 0;
 *  The clear bit for SPI_MEM_C_SLV_ST_END_INT interrupt.
 */
#define SPI_MEM_C_SLV_ST_END_INT_CLR    (BIT(3))
#define SPI_MEM_C_SLV_ST_END_INT_CLR_M  (SPI_MEM_C_SLV_ST_END_INT_CLR_V << SPI_MEM_C_SLV_ST_END_INT_CLR_S)
#define SPI_MEM_C_SLV_ST_END_INT_CLR_V  0x00000001U
#define SPI_MEM_C_SLV_ST_END_INT_CLR_S  3
/** SPI_MEM_C_MST_ST_END_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The clear bit for SPI_MEM_C_MST_ST_END_INT interrupt.
 */
#define SPI_MEM_C_MST_ST_END_INT_CLR    (BIT(4))
#define SPI_MEM_C_MST_ST_END_INT_CLR_M  (SPI_MEM_C_MST_ST_END_INT_CLR_V << SPI_MEM_C_MST_ST_END_INT_CLR_S)
#define SPI_MEM_C_MST_ST_END_INT_CLR_V  0x00000001U
#define SPI_MEM_C_MST_ST_END_INT_CLR_S  4
/** SPI_MEM_C_ECC_ERR_INT_CLR : HRO; bitpos: [5]; default: 0;
 *  The clear bit for SPI_MEM_C_ECC_ERR_INT interrupt.
 */
#define SPI_MEM_C_ECC_ERR_INT_CLR    (BIT(5))
#define SPI_MEM_C_ECC_ERR_INT_CLR_M  (SPI_MEM_C_ECC_ERR_INT_CLR_V << SPI_MEM_C_ECC_ERR_INT_CLR_S)
#define SPI_MEM_C_ECC_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_C_ECC_ERR_INT_CLR_S  5
/** SPI_MEM_C_PMS_REJECT_INT_CLR : WT; bitpos: [6]; default: 0;
 *  The clear bit for SPI_MEM_C_PMS_REJECT_INT interrupt.
 */
#define SPI_MEM_C_PMS_REJECT_INT_CLR    (BIT(6))
#define SPI_MEM_C_PMS_REJECT_INT_CLR_M  (SPI_MEM_C_PMS_REJECT_INT_CLR_V << SPI_MEM_C_PMS_REJECT_INT_CLR_S)
#define SPI_MEM_C_PMS_REJECT_INT_CLR_V  0x00000001U
#define SPI_MEM_C_PMS_REJECT_INT_CLR_S  6
/** SPI_MEM_C_AXI_RADDR_ERR_INT_CLR : WT; bitpos: [7]; default: 0;
 *  The clear bit for SPI_MEM_C_AXI_RADDR_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_RADDR_ERR_INT_CLR    (BIT(7))
#define SPI_MEM_C_AXI_RADDR_ERR_INT_CLR_M  (SPI_MEM_C_AXI_RADDR_ERR_INT_CLR_V << SPI_MEM_C_AXI_RADDR_ERR_INT_CLR_S)
#define SPI_MEM_C_AXI_RADDR_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_C_AXI_RADDR_ERR_INT_CLR_S  7
/** SPI_MEM_C_AXI_WR_FLASH_ERR_INT_CLR : WT; bitpos: [8]; default: 0;
 *  The clear bit for SPI_MEM_C_AXI_WR_FALSH_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_CLR    (BIT(8))
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_CLR_M  (SPI_MEM_C_AXI_WR_FLASH_ERR_INT_CLR_V << SPI_MEM_C_AXI_WR_FLASH_ERR_INT_CLR_S)
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_CLR_S  8
/** SPI_MEM_C_AXI_WADDR_ERR_INT_CLR : WT; bitpos: [9]; default: 0;
 *  The clear bit for SPI_MEM_C_AXI_WADDR_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_WADDR_ERR_INT_CLR    (BIT(9))
#define SPI_MEM_C_AXI_WADDR_ERR_INT_CLR_M  (SPI_MEM_C_AXI_WADDR_ERR_INT_CLR_V << SPI_MEM_C_AXI_WADDR_ERR_INT_CLR_S)
#define SPI_MEM_C_AXI_WADDR_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_C_AXI_WADDR_ERR_INT_CLR_S  9
/** SPI_MEM_C_NANDFLASH_PE_FAIL_INT_CLR : WT; bitpos: [11]; default: 0;
 *  The clear bit for SPI_MEM_C_NANDFLASH_PE_FAIL_INT interrupt.
 */
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_CLR    (BIT(11))
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_CLR_M  (SPI_MEM_C_NANDFLASH_PE_FAIL_INT_CLR_V << SPI_MEM_C_NANDFLASH_PE_FAIL_INT_CLR_S)
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_CLR_V  0x00000001U
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_CLR_S  11
/** SPI_MEM_C_NANDFLASH_ECC_ERR_INT_CLR : WT; bitpos: [12]; default: 0;
 *  The clear bit for SPI_MEM_C_NANDFLASH_ECC_ERR_INT interrupt.
 */
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_CLR    (BIT(12))
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_CLR_M  (SPI_MEM_C_NANDFLASH_ECC_ERR_INT_CLR_V << SPI_MEM_C_NANDFLASH_ECC_ERR_INT_CLR_S)
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_CLR_S  12
/** SPI_MEM_C_XTS_FAULT_DETECTED_INT_CLR : WT; bitpos: [13]; default: 0;
 *  The clear  bit for SPI_MEM_C_XTS_FAULT_DETECTED_INT interrupt.
 */
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_CLR    (BIT(13))
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_CLR_M  (SPI_MEM_C_XTS_FAULT_DETECTED_INT_CLR_V << SPI_MEM_C_XTS_FAULT_DETECTED_INT_CLR_S)
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_CLR_V  0x00000001U
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_CLR_S  13
/** SPI_MEM_C_RX_TRANS_OVF_INT_CLR : HRO; bitpos: [26]; default: 0;
 *  The clear bit for SPI_MEM_C_RX_TRANS_OVF_INT interrupt.
 */
#define SPI_MEM_C_RX_TRANS_OVF_INT_CLR    (BIT(26))
#define SPI_MEM_C_RX_TRANS_OVF_INT_CLR_M  (SPI_MEM_C_RX_TRANS_OVF_INT_CLR_V << SPI_MEM_C_RX_TRANS_OVF_INT_CLR_S)
#define SPI_MEM_C_RX_TRANS_OVF_INT_CLR_V  0x00000001U
#define SPI_MEM_C_RX_TRANS_OVF_INT_CLR_S  26
/** SPI_MEM_C_TX_TRANS_UDF_INT_CLR : HRO; bitpos: [27]; default: 0;
 *  The clear bit for SPI_MEM_C_TX_TRANS_UDF_INT interrupt.
 */
#define SPI_MEM_C_TX_TRANS_UDF_INT_CLR    (BIT(27))
#define SPI_MEM_C_TX_TRANS_UDF_INT_CLR_M  (SPI_MEM_C_TX_TRANS_UDF_INT_CLR_V << SPI_MEM_C_TX_TRANS_UDF_INT_CLR_S)
#define SPI_MEM_C_TX_TRANS_UDF_INT_CLR_V  0x00000001U
#define SPI_MEM_C_TX_TRANS_UDF_INT_CLR_S  27

/** SPI_MEM_C_INT_RAW_REG register
 *  SPI0 interrupt raw register
 */
#define SPI_MEM_C_INT_RAW_REG (DR_REG_FLASH_SPI0_BASE + 0xc8)
/** SPI_MEM_C_SLV_ST_END_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw bit for SPI_MEM_C_SLV_ST_END_INT interrupt. 1: Triggered when spi0_slv_st is
 *  changed from non idle state to idle state. It means that SPI_CS raises high. 0:
 *  Others
 */
#define SPI_MEM_C_SLV_ST_END_INT_RAW    (BIT(3))
#define SPI_MEM_C_SLV_ST_END_INT_RAW_M  (SPI_MEM_C_SLV_ST_END_INT_RAW_V << SPI_MEM_C_SLV_ST_END_INT_RAW_S)
#define SPI_MEM_C_SLV_ST_END_INT_RAW_V  0x00000001U
#define SPI_MEM_C_SLV_ST_END_INT_RAW_S  3
/** SPI_MEM_C_MST_ST_END_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit for SPI_MEM_C_MST_ST_END_INT interrupt. 1: Triggered when spi0_mst_st is
 *  changed from non idle state to idle state. 0: Others.
 */
#define SPI_MEM_C_MST_ST_END_INT_RAW    (BIT(4))
#define SPI_MEM_C_MST_ST_END_INT_RAW_M  (SPI_MEM_C_MST_ST_END_INT_RAW_V << SPI_MEM_C_MST_ST_END_INT_RAW_S)
#define SPI_MEM_C_MST_ST_END_INT_RAW_V  0x00000001U
#define SPI_MEM_C_MST_ST_END_INT_RAW_S  4
/** SPI_MEM_C_ECC_ERR_INT_RAW : HRO; bitpos: [5]; default: 0;
 *  The raw bit for SPI_MEM_C_ECC_ERR_INT interrupt. When SPI_FMEM_C_ECC_ERR_INT_EN is set
 *  and  SPI_SMEM_C_ECC_ERR_INT_EN is cleared, this bit is triggered when the error times
 *  of SPI0/1 ECC read flash are equal or bigger than SPI_MEM_C_ECC_ERR_INT_NUM. When
 *  SPI_FMEM_C_ECC_ERR_INT_EN is cleared and  SPI_SMEM_C_ECC_ERR_INT_EN is set, this bit is
 *  triggered when the error times of SPI0/1 ECC read external RAM are equal or bigger
 *  than SPI_MEM_C_ECC_ERR_INT_NUM. When SPI_FMEM_C_ECC_ERR_INT_EN and
 *  SPI_SMEM_C_ECC_ERR_INT_EN are set, this bit is triggered when the total error times
 *  of SPI0/1 ECC read external RAM and flash are equal or bigger than
 *  SPI_MEM_C_ECC_ERR_INT_NUM. When SPI_FMEM_C_ECC_ERR_INT_EN and  SPI_SMEM_C_ECC_ERR_INT_EN
 *  are cleared, this bit will not be triggered.
 */
#define SPI_MEM_C_ECC_ERR_INT_RAW    (BIT(5))
#define SPI_MEM_C_ECC_ERR_INT_RAW_M  (SPI_MEM_C_ECC_ERR_INT_RAW_V << SPI_MEM_C_ECC_ERR_INT_RAW_S)
#define SPI_MEM_C_ECC_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_C_ECC_ERR_INT_RAW_S  5
/** SPI_MEM_C_PMS_REJECT_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw bit for SPI_MEM_C_PMS_REJECT_INT interrupt. 1: Triggered when SPI1 access is
 *  rejected. 0: Others.
 */
#define SPI_MEM_C_PMS_REJECT_INT_RAW    (BIT(6))
#define SPI_MEM_C_PMS_REJECT_INT_RAW_M  (SPI_MEM_C_PMS_REJECT_INT_RAW_V << SPI_MEM_C_PMS_REJECT_INT_RAW_S)
#define SPI_MEM_C_PMS_REJECT_INT_RAW_V  0x00000001U
#define SPI_MEM_C_PMS_REJECT_INT_RAW_S  6
/** SPI_MEM_C_AXI_RADDR_ERR_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw bit for SPI_MEM_C_AXI_RADDR_ERR_INT interrupt. 1: Triggered when AXI read
 *  address is invalid by compared to MMU configuration. 0: Others.
 */
#define SPI_MEM_C_AXI_RADDR_ERR_INT_RAW    (BIT(7))
#define SPI_MEM_C_AXI_RADDR_ERR_INT_RAW_M  (SPI_MEM_C_AXI_RADDR_ERR_INT_RAW_V << SPI_MEM_C_AXI_RADDR_ERR_INT_RAW_S)
#define SPI_MEM_C_AXI_RADDR_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_C_AXI_RADDR_ERR_INT_RAW_S  7
/** SPI_MEM_C_AXI_WR_FLASH_ERR_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw bit for SPI_MEM_C_AXI_WR_FALSH_ERR_INT interrupt. 1: Triggered when AXI write
 *  flash request is received. 0: Others.
 */
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_RAW    (BIT(8))
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_RAW_M  (SPI_MEM_C_AXI_WR_FLASH_ERR_INT_RAW_V << SPI_MEM_C_AXI_WR_FLASH_ERR_INT_RAW_S)
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_RAW_S  8
/** SPI_MEM_C_AXI_WADDR_ERR_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw bit for SPI_MEM_C_AXI_WADDR_ERR_INT interrupt. 1: Triggered when AXI write
 *  address is invalid by compared to MMU configuration. 0: Others.
 */
#define SPI_MEM_C_AXI_WADDR_ERR_INT_RAW    (BIT(9))
#define SPI_MEM_C_AXI_WADDR_ERR_INT_RAW_M  (SPI_MEM_C_AXI_WADDR_ERR_INT_RAW_V << SPI_MEM_C_AXI_WADDR_ERR_INT_RAW_S)
#define SPI_MEM_C_AXI_WADDR_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_C_AXI_WADDR_ERR_INT_RAW_S  9
/** SPI_MEM_C_NANDFLASH_PE_FAIL_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw bit for SPI_MEM_C_NANDFLASH_PE_FAIL_INT interrupt. 1: Triggered when NAND
 *  FLASH SPI SEQ found P/E_FAIL bits is err when RDSR. 0: Others.
 */
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_RAW    (BIT(11))
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_RAW_M  (SPI_MEM_C_NANDFLASH_PE_FAIL_INT_RAW_V << SPI_MEM_C_NANDFLASH_PE_FAIL_INT_RAW_S)
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_RAW_V  0x00000001U
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_RAW_S  11
/** SPI_MEM_C_NANDFLASH_ECC_ERR_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw bit for SPI_MEM_C_NANDFLASH_ECC_ERR_INT interrupt. 1: Triggered when NAND
 *  FLASH SPI SEQ found ECCS bits is err when RDSR. 0: Others.
 */
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_RAW    (BIT(12))
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_RAW_M  (SPI_MEM_C_NANDFLASH_ECC_ERR_INT_RAW_V << SPI_MEM_C_NANDFLASH_ECC_ERR_INT_RAW_S)
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_RAW_S  12
/** SPI_MEM_C_XTS_FAULT_DETECTED_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw bit for SPI_MEM_C_XTS_FAULT_DETECTED_INT interrupt. 1: Triggered when xts aes
 *  core detected fault injection attack. 0: Others.
 */
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_RAW    (BIT(13))
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_RAW_M  (SPI_MEM_C_XTS_FAULT_DETECTED_INT_RAW_V << SPI_MEM_C_XTS_FAULT_DETECTED_INT_RAW_S)
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_RAW_V  0x00000001U
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_RAW_S  13
/** SPI_MEM_C_RX_TRANS_OVF_INT_RAW : R/WTC/SS; bitpos: [26]; default: 0;
 *  The raw bit for  SPI_MEM_C_RX_TRANS_OVF_INT interrupt. 1: Triggered when the rx fifo
 *  to spi bus is overrflow.
 */
#define SPI_MEM_C_RX_TRANS_OVF_INT_RAW    (BIT(26))
#define SPI_MEM_C_RX_TRANS_OVF_INT_RAW_M  (SPI_MEM_C_RX_TRANS_OVF_INT_RAW_V << SPI_MEM_C_RX_TRANS_OVF_INT_RAW_S)
#define SPI_MEM_C_RX_TRANS_OVF_INT_RAW_V  0x00000001U
#define SPI_MEM_C_RX_TRANS_OVF_INT_RAW_S  26
/** SPI_MEM_C_TX_TRANS_UDF_INT_RAW : R/WTC/SS; bitpos: [27]; default: 0;
 *  The raw bit for SPI_MEM_C_TX_TRANS_UDF_INT interrupt. 1: Triggered when the tx fifo
 *  to spi bus is underflow.
 */
#define SPI_MEM_C_TX_TRANS_UDF_INT_RAW    (BIT(27))
#define SPI_MEM_C_TX_TRANS_UDF_INT_RAW_M  (SPI_MEM_C_TX_TRANS_UDF_INT_RAW_V << SPI_MEM_C_TX_TRANS_UDF_INT_RAW_S)
#define SPI_MEM_C_TX_TRANS_UDF_INT_RAW_V  0x00000001U
#define SPI_MEM_C_TX_TRANS_UDF_INT_RAW_S  27

