espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_INT_ST_REG register
 *  SPI0 interrupt status register
 */
#define SPI_MEM_C_INT_ST_REG (DR_REG_FLASH_SPI0_BASE + 0xcc)
/** SPI_MEM_C_SLV_ST_END_INT_ST : RO; bitpos: [3]; default: 0;
 *  The status bit for SPI_MEM_C_SLV_ST_END_INT interrupt.
 */
#define SPI_MEM_C_SLV_ST_END_INT_ST    (BIT(3))
#define SPI_MEM_C_SLV_ST_END_INT_ST_M  (SPI_MEM_C_SLV_ST_END_INT_ST_V << SPI_MEM_C_SLV_ST_END_INT_ST_S)
#define SPI_MEM_C_SLV_ST_END_INT_ST_V  0x00000001U
#define SPI_MEM_C_SLV_ST_END_INT_ST_S  3
/** SPI_MEM_C_MST_ST_END_INT_ST : RO; bitpos: [4]; default: 0;
 *  The status bit for SPI_MEM_C_MST_ST_END_INT interrupt.
 */
#define SPI_MEM_C_MST_ST_END_INT_ST    (BIT(4))
#define SPI_MEM_C_MST_ST_END_INT_ST_M  (SPI_MEM_C_MST_ST_END_INT_ST_V << SPI_MEM_C_MST_ST_END_INT_ST_S)
#define SPI_MEM_C_MST_ST_END_INT_ST_V  0x00000001U
#define SPI_MEM_C_MST_ST_END_INT_ST_S  4
/** SPI_MEM_C_ECC_ERR_INT_ST : RO; bitpos: [5]; default: 0;
 *  The status bit for SPI_MEM_C_ECC_ERR_INT interrupt.
 */
#define SPI_MEM_C_ECC_ERR_INT_ST    (BIT(5))
#define SPI_MEM_C_ECC_ERR_INT_ST_M  (SPI_MEM_C_ECC_ERR_INT_ST_V << SPI_MEM_C_ECC_ERR_INT_ST_S)
#define SPI_MEM_C_ECC_ERR_INT_ST_V  0x00000001U
#define SPI_MEM_C_ECC_ERR_INT_ST_S  5
/** SPI_MEM_C_PMS_REJECT_INT_ST : RO; bitpos: [6]; default: 0;
 *  The status bit for SPI_MEM_C_PMS_REJECT_INT interrupt.
 */
#define SPI_MEM_C_PMS_REJECT_INT_ST    (BIT(6))
#define SPI_MEM_C_PMS_REJECT_INT_ST_M  (SPI_MEM_C_PMS_REJECT_INT_ST_V << SPI_MEM_C_PMS_REJECT_INT_ST_S)
#define SPI_MEM_C_PMS_REJECT_INT_ST_V  0x00000001U
#define SPI_MEM_C_PMS_REJECT_INT_ST_S  6
/** SPI_MEM_C_AXI_RADDR_ERR_INT_ST : RO; bitpos: [7]; default: 0;
 *  The status bit for SPI_MEM_C_AXI_RADDR_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_RADDR_ERR_INT_ST    (BIT(7))
#define SPI_MEM_C_AXI_RADDR_ERR_INT_ST_M  (SPI_MEM_C_AXI_RADDR_ERR_INT_ST_V << SPI_MEM_C_AXI_RADDR_ERR_INT_ST_S)
#define SPI_MEM_C_AXI_RADDR_ERR_INT_ST_V  0x00000001U
#define SPI_MEM_C_AXI_RADDR_ERR_INT_ST_S  7
/** SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ST : RO; bitpos: [8]; default: 0;
 *  The status bit for SPI_MEM_C_AXI_WR_FALSH_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ST    (BIT(8))
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ST_M  (SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ST_V << SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ST_S)
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ST_V  0x00000001U
#define SPI_MEM_C_AXI_WR_FLASH_ERR_INT_ST_S  8
/** SPI_MEM_C_AXI_WADDR_ERR_INT_ST : RO; bitpos: [9]; default: 0;
 *  The status bit for SPI_MEM_C_AXI_WADDR_ERR_INT interrupt.
 */
#define SPI_MEM_C_AXI_WADDR_ERR_INT_ST    (BIT(9))
#define SPI_MEM_C_AXI_WADDR_ERR_INT_ST_M  (SPI_MEM_C_AXI_WADDR_ERR_INT_ST_V << SPI_MEM_C_AXI_WADDR_ERR_INT_ST_S)
#define SPI_MEM_C_AXI_WADDR_ERR_INT_ST_V  0x00000001U
#define SPI_MEM_C_AXI_WADDR_ERR_INT_ST_S  9
/** SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ST : RO; bitpos: [11]; default: 0;
 *  The status bit for SPI_MEM_C_NANDFLASH_PE_FAIL_INT interrupt.
 */
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ST    (BIT(11))
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ST_M  (SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ST_V << SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ST_S)
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ST_V  0x00000001U
#define SPI_MEM_C_NANDFLASH_PE_FAIL_INT_ST_S  11
/** SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ST : RO; bitpos: [12]; default: 0;
 *  The status bit for SPI_MEM_C_NANDFLASH_ECC_ERR_INT interrupt.
 */
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ST    (BIT(12))
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ST_M  (SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ST_V << SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ST_S)
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ST_V  0x00000001U
#define SPI_MEM_C_NANDFLASH_ECC_ERR_INT_ST_S  12
/** SPI_MEM_C_XTS_FAULT_DETECTED_INT_ST : RO; bitpos: [13]; default: 0;
 *  The status bit for SPI_MEM_C_XTS_FAULT_DETECTED_INT interrupt.
 */
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_ST    (BIT(13))
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_ST_M  (SPI_MEM_C_XTS_FAULT_DETECTED_INT_ST_V << SPI_MEM_C_XTS_FAULT_DETECTED_INT_ST_S)
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_ST_V  0x00000001U
#define SPI_MEM_C_XTS_FAULT_DETECTED_INT_ST_S  13
/** SPI_MEM_C_RX_TRANS_OVF_INT_ST : HRO; bitpos: [26]; default: 0;
 *  The status bit for  SPI_MEM_C_RX_TRANS_OVF_INT interrupt.
 */
#define SPI_MEM_C_RX_TRANS_OVF_INT_ST    (BIT(26))
#define SPI_MEM_C_RX_TRANS_OVF_INT_ST_M  (SPI_MEM_C_RX_TRANS_OVF_INT_ST_V << SPI_MEM_C_RX_TRANS_OVF_INT_ST_S)
#define SPI_MEM_C_RX_TRANS_OVF_INT_ST_V  0x00000001U
#define SPI_MEM_C_RX_TRANS_OVF_INT_ST_S  26
/** SPI_MEM_C_TX_TRANS_UDF_INT_ST : HRO; bitpos: [27]; default: 0;
 *  The status bit for SPI_MEM_C_TX_TRANS_UDF_INT interrupt.
 */
#define SPI_MEM_C_TX_TRANS_UDF_INT_ST    (BIT(27))
#define SPI_MEM_C_TX_TRANS_UDF_INT_ST_M  (SPI_MEM_C_TX_TRANS_UDF_INT_ST_V << SPI_MEM_C_TX_TRANS_UDF_INT_ST_S)
#define SPI_MEM_C_TX_TRANS_UDF_INT_ST_V  0x00000001U
#define SPI_MEM_C_TX_TRANS_UDF_INT_ST_S  27

/** SPI_MEM_C_DDR_REG register
 *  SPI0 flash DDR mode control register
 */
#define SPI_MEM_C_DDR_REG (DR_REG_FLASH_SPI0_BASE + 0xd4)
/** SPI_FMEM_C_DDR_EN : R/W; bitpos: [0]; default: 0;
 *  1: in DDR mode,  0 in SDR mode
 */
#define SPI_FMEM_C_DDR_EN    (BIT(0))
#define SPI_FMEM_C_DDR_EN_M  (SPI_FMEM_C_DDR_EN_V << SPI_FMEM_C_DDR_EN_S)
#define SPI_FMEM_C_DDR_EN_V  0x00000001U
#define SPI_FMEM_C_DDR_EN_S  0
/** SPI_FMEM_C_VAR_DUMMY : HRO; bitpos: [1]; default: 0;
 *  Set the bit to enable variable dummy cycle in spi DDR mode.
 */
#define SPI_FMEM_C_VAR_DUMMY    (BIT(1))
#define SPI_FMEM_C_VAR_DUMMY_M  (SPI_FMEM_C_VAR_DUMMY_V << SPI_FMEM_C_VAR_DUMMY_S)
#define SPI_FMEM_C_VAR_DUMMY_V  0x00000001U
#define SPI_FMEM_C_VAR_DUMMY_S  1
/** SPI_FMEM_C_DDR_RDAT_SWP : HRO; bitpos: [2]; default: 0;
 *  Set the bit to reorder rx data of the word in spi DDR mode.
 */
#define SPI_FMEM_C_DDR_RDAT_SWP    (BIT(2))
#define SPI_FMEM_C_DDR_RDAT_SWP_M  (SPI_FMEM_C_DDR_RDAT_SWP_V << SPI_FMEM_C_DDR_RDAT_SWP_S)
#define SPI_FMEM_C_DDR_RDAT_SWP_V  0x00000001U
#define SPI_FMEM_C_DDR_RDAT_SWP_S  2
/** SPI_FMEM_C_DDR_WDAT_SWP : HRO; bitpos: [3]; default: 0;
 *  Set the bit to reorder tx data of the word in spi DDR mode.
 */
#define SPI_FMEM_C_DDR_WDAT_SWP    (BIT(3))
#define SPI_FMEM_C_DDR_WDAT_SWP_M  (SPI_FMEM_C_DDR_WDAT_SWP_V << SPI_FMEM_C_DDR_WDAT_SWP_S)
#define SPI_FMEM_C_DDR_WDAT_SWP_V  0x00000001U
#define SPI_FMEM_C_DDR_WDAT_SWP_S  3
/** SPI_FMEM_C_DDR_CMD_DIS : R/W; bitpos: [4]; default: 0;
 *  the bit is used to disable dual edge in command phase when DDR mode.
 */
#define SPI_FMEM_C_DDR_CMD_DIS    (BIT(4))
#define SPI_FMEM_C_DDR_CMD_DIS_M  (SPI_FMEM_C_DDR_CMD_DIS_V << SPI_FMEM_C_DDR_CMD_DIS_S)
#define SPI_FMEM_C_DDR_CMD_DIS_V  0x00000001U
#define SPI_FMEM_C_DDR_CMD_DIS_S  4
/** SPI_FMEM_C_OUTMINBYTELEN : HRO; bitpos: [11:5]; default: 1;
 *  It is the minimum output data length in the panda device.
 */
#define SPI_FMEM_C_OUTMINBYTELEN    0x0000007FU
#define SPI_FMEM_C_OUTMINBYTELEN_M  (SPI_FMEM_C_OUTMINBYTELEN_V << SPI_FMEM_C_OUTMINBYTELEN_S)
#define SPI_FMEM_C_OUTMINBYTELEN_V  0x0000007FU
#define SPI_FMEM_C_OUTMINBYTELEN_S  5
/** SPI_FMEM_C_TX_DDR_MSK_EN : R/W; bitpos: [12]; default: 1;
 *  Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when
 *  accesses to flash.
 */
#define SPI_FMEM_C_TX_DDR_MSK_EN    (BIT(12))
#define SPI_FMEM_C_TX_DDR_MSK_EN_M  (SPI_FMEM_C_TX_DDR_MSK_EN_V << SPI_FMEM_C_TX_DDR_MSK_EN_S)
#define SPI_FMEM_C_TX_DDR_MSK_EN_V  0x00000001U
#define SPI_FMEM_C_TX_DDR_MSK_EN_S  12
/** SPI_FMEM_C_RX_DDR_MSK_EN : R/W; bitpos: [13]; default: 1;
 *  Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when
 *  accesses to flash.
 */
#define SPI_FMEM_C_RX_DDR_MSK_EN    (BIT(13))
#define SPI_FMEM_C_RX_DDR_MSK_EN_M  (SPI_FMEM_C_RX_DDR_MSK_EN_V << SPI_FMEM_C_RX_DDR_MSK_EN_S)
#define SPI_FMEM_C_RX_DDR_MSK_EN_V  0x00000001U
#define SPI_FMEM_C_RX_DDR_MSK_EN_S  13
/** SPI_FMEM_C_USR_DDR_DQS_THD : HRO; bitpos: [20:14]; default: 0;
 *  The delay number of data strobe which from memory based on SPI clock.
 */
#define SPI_FMEM_C_USR_DDR_DQS_THD    0x0000007FU
#define SPI_FMEM_C_USR_DDR_DQS_THD_M  (SPI_FMEM_C_USR_DDR_DQS_THD_V << SPI_FMEM_C_USR_DDR_DQS_THD_S)
#define SPI_FMEM_C_USR_DDR_DQS_THD_V  0x0000007FU
#define SPI_FMEM_C_USR_DDR_DQS_THD_S  14
/** SPI_FMEM_C_DDR_DQS_LOOP : HRO; bitpos: [21]; default: 0;
 *  1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when
 *  spi0_slv_st is in SPI_MEM_C_DIN state. It is used when there is no SPI_DQS signal or
 *  SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and
 *  negative edge of SPI_DQS.
 */
#define SPI_FMEM_C_DDR_DQS_LOOP    (BIT(21))
#define SPI_FMEM_C_DDR_DQS_LOOP_M  (SPI_FMEM_C_DDR_DQS_LOOP_V << SPI_FMEM_C_DDR_DQS_LOOP_S)
#define SPI_FMEM_C_DDR_DQS_LOOP_V  0x00000001U
#define SPI_FMEM_C_DDR_DQS_LOOP_S  21
/** SPI_FMEM_C_CLK_DIFF_EN : HRO; bitpos: [24]; default: 0;
 *  Set this bit to enable the differential SPI_CLK#.
 */
#define SPI_FMEM_C_CLK_DIFF_EN    (BIT(24))
#define SPI_FMEM_C_CLK_DIFF_EN_M  (SPI_FMEM_C_CLK_DIFF_EN_V << SPI_FMEM_C_CLK_DIFF_EN_S)
#define SPI_FMEM_C_CLK_DIFF_EN_V  0x00000001U
#define SPI_FMEM_C_CLK_DIFF_EN_S  24
/** SPI_FMEM_C_DQS_CA_IN : HRO; bitpos: [26]; default: 0;
 *  Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR.
 */
#define SPI_FMEM_C_DQS_CA_IN    (BIT(26))
#define SPI_FMEM_C_DQS_CA_IN_M  (SPI_FMEM_C_DQS_CA_IN_V << SPI_FMEM_C_DQS_CA_IN_S)
#define SPI_FMEM_C_DQS_CA_IN_V  0x00000001U
#define SPI_FMEM_C_DQS_CA_IN_S  26
/** SPI_FMEM_C_HYPERBUS_DUMMY_2X : HRO; bitpos: [27]; default: 0;
 *  Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0
 *  accesses flash or SPI1 accesses flash or sram.
 */
#define SPI_FMEM_C_HYPERBUS_DUMMY_2X    (BIT(27))
#define SPI_FMEM_C_HYPERBUS_DUMMY_2X_M  (SPI_FMEM_C_HYPERBUS_DUMMY_2X_V << SPI_FMEM_C_HYPERBUS_DUMMY_2X_S)
#define SPI_FMEM_C_HYPERBUS_DUMMY_2X_V  0x00000001U
#define SPI_FMEM_C_HYPERBUS_DUMMY_2X_S  27
/** SPI_FMEM_C_CLK_DIFF_INV : HRO; bitpos: [28]; default: 0;
 *  Set this bit to invert SPI_DIFF when accesses to flash. .
 */
#define SPI_FMEM_C_CLK_DIFF_INV    (BIT(28))
#define SPI_FMEM_C_CLK_DIFF_INV_M  (SPI_FMEM_C_CLK_DIFF_INV_V << SPI_FMEM_C_CLK_DIFF_INV_S)
#define SPI_FMEM_C_CLK_DIFF_INV_V  0x00000001U
#define SPI_FMEM_C_CLK_DIFF_INV_S  28
/** SPI_FMEM_C_OCTA_RAM_ADDR : HRO; bitpos: [29]; default: 0;
 *  Set this bit to enable octa_ram address out when accesses to flash, which means
 *  ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1], 1'b0}.
 */
#define SPI_FMEM_C_OCTA_RAM_ADDR    (BIT(29))
#define SPI_FMEM_C_OCTA_RAM_ADDR_M  (SPI_FMEM_C_OCTA_RAM_ADDR_V << SPI_FMEM_C_OCTA_RAM_ADDR_S)
#define SPI_FMEM_C_OCTA_RAM_ADDR_V  0x00000001U
#define SPI_FMEM_C_OCTA_RAM_ADDR_S  29
/** SPI_FMEM_C_HYPERBUS_CA : HRO; bitpos: [30]; default: 0;
 *  Set this bit to enable HyperRAM address out when accesses to flash, which means
 *  ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}.
 */
#define SPI_FMEM_C_HYPERBUS_CA    (BIT(30))
#define SPI_FMEM_C_HYPERBUS_CA_M  (SPI_FMEM_C_HYPERBUS_CA_V << SPI_FMEM_C_HYPERBUS_CA_S)
#define SPI_FMEM_C_HYPERBUS_CA_V  0x00000001U
#define SPI_FMEM_C_HYPERBUS_CA_S  30

/** SPI_SMEM_C_DDR_REG register
 *  SPI0 external RAM DDR mode control register
 */
#define SPI_SMEM_C_DDR_REG (DR_REG_FLASH_SPI0_BASE + 0xd8)
/** SPI_SMEM_C_DDR_EN : HRO; bitpos: [0]; default: 0;
 *  1: in DDR mode,  0 in SDR mode
 */
#define SPI_SMEM_C_DDR_EN    (BIT(0))
#define SPI_SMEM_C_DDR_EN_M  (SPI_SMEM_C_DDR_EN_V << SPI_SMEM_C_DDR_EN_S)
#define SPI_SMEM_C_DDR_EN_V  0x00000001U
#define SPI_SMEM_C_DDR_EN_S  0
/** SPI_SMEM_C_VAR_DUMMY : HRO; bitpos: [1]; default: 0;
 *  Set the bit to enable variable dummy cycle in spi DDR mode.
 */
#define SPI_SMEM_C_VAR_DUMMY    (BIT(1))
#define SPI_SMEM_C_VAR_DUMMY_M  (SPI_SMEM_C_VAR_DUMMY_V << SPI_SMEM_C_VAR_DUMMY_S)
#define SPI_SMEM_C_VAR_DUMMY_V  0x00000001U
#define SPI_SMEM_C_VAR_DUMMY_S  1
/** SPI_SMEM_C_DDR_RDAT_SWP : HRO; bitpos: [2]; default: 0;
 *  Set the bit to reorder rx data of the word in spi DDR mode.
 */
#define SPI_SMEM_C_DDR_RDAT_SWP    (BIT(2))
#define SPI_SMEM_C_DDR_RDAT_SWP_M  (SPI_SMEM_C_DDR_RDAT_SWP_V << SPI_SMEM_C_DDR_RDAT_SWP_S)
#define SPI_SMEM_C_DDR_RDAT_SWP_V  0x00000001U
#define SPI_SMEM_C_DDR_RDAT_SWP_S  2
/** SPI_SMEM_C_DDR_WDAT_SWP : HRO; bitpos: [3]; default: 0;
 *  Set the bit to reorder tx data of the word in spi DDR mode.
 */
#define SPI_SMEM_C_DDR_WDAT_SWP    (BIT(3))
#define SPI_SMEM_C_DDR_WDAT_SWP_M  (SPI_SMEM_C_DDR_WDAT_SWP_V << SPI_SMEM_C_DDR_WDAT_SWP_S)
#define SPI_SMEM_C_DDR_WDAT_SWP_V  0x00000001U
#define SPI_SMEM_C_DDR_WDAT_SWP_S  3
/** SPI_SMEM_C_DDR_CMD_DIS : HRO; bitpos: [4]; default: 0;
 *  the bit is used to disable dual edge in command phase when DDR mode.
 */
#define SPI_SMEM_C_DDR_CMD_DIS    (BIT(4))
#define SPI_SMEM_C_DDR_CMD_DIS_M  (SPI_SMEM_C_DDR_CMD_DIS_V << SPI_SMEM_C_DDR_CMD_DIS_S)
#define SPI_SMEM_C_DDR_CMD_DIS_V  0x00000001U
#define SPI_SMEM_C_DDR_CMD_DIS_S  4
/** SPI_SMEM_C_OUTMINBYTELEN : HRO; bitpos: [11:5]; default: 1;
 *  It is the minimum output data length in the DDR psram.
 */
#define SPI_SMEM_C_OUTMINBYTELEN    0x0000007FU
#define SPI_SMEM_C_OUTMINBYTELEN_M  (SPI_SMEM_C_OUTMINBYTELEN_V << SPI_SMEM_C_OUTMINBYTELEN_S)
#define SPI_SMEM_C_OUTMINBYTELEN_V  0x0000007FU
#define SPI_SMEM_C_OUTMINBYTELEN_S  5
/** SPI_SMEM_C_TX_DDR_MSK_EN : HRO; bitpos: [12]; default: 1;
 *  Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when
 *  accesses to external RAM.
 */
#define SPI_SMEM_C_TX_DDR_MSK_EN    (BIT(12))
#define SPI_SMEM_C_TX_DDR_MSK_EN_M  (SPI_SMEM_C_TX_DDR_MSK_EN_V << SPI_SMEM_C_TX_DDR_MSK_EN_S)
#define SPI_SMEM_C_TX_DDR_MSK_EN_V  0x00000001U
#define SPI_SMEM_C_TX_DDR_MSK_EN_S  12
/** SPI_SMEM_C_RX_DDR_MSK_EN : HRO; bitpos: [13]; default: 1;
 *  Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when
 *  accesses to external RAM.
 */
#define SPI_SMEM_C_RX_DDR_MSK_EN    (BIT(13))
#define SPI_SMEM_C_RX_DDR_MSK_EN_M  (SPI_SMEM_C_RX_DDR_MSK_EN_V << SPI_SMEM_C_RX_DDR_MSK_EN_S)
#define SPI_SMEM_C_RX_DDR_MSK_EN_V  0x00000001U
#define SPI_SMEM_C_RX_DDR_MSK_EN_S  13
/** SPI_SMEM_C_USR_DDR_DQS_THD : HRO; bitpos: [20:14]; default: 0;
 *  The delay number of data strobe which from memory based on SPI clock.
 */
#define SPI_SMEM_C_USR_DDR_DQS_THD    0x0000007FU
#define SPI_SMEM_C_USR_DDR_DQS_THD_M  (SPI_SMEM_C_USR_DDR_DQS_THD_V << SPI_SMEM_C_USR_DDR_DQS_THD_S)
#define SPI_SMEM_C_USR_DDR_DQS_THD_V  0x0000007FU
#define SPI_SMEM_C_USR_DDR_DQS_THD_S  14
/** SPI_SMEM_C_DDR_DQS_LOOP : HRO; bitpos: [21]; default: 0;
 *  1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when
 *  spi0_slv_st is in SPI_MEM_C_DIN state. It is used when there is no SPI_DQS signal or
 *  SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and
 *  negative edge of SPI_DQS.
 */
#define SPI_SMEM_C_DDR_DQS_LOOP    (BIT(21))
#define SPI_SMEM_C_DDR_DQS_LOOP_M  (SPI_SMEM_C_DDR_DQS_LOOP_V << SPI_SMEM_C_DDR_DQS_LOOP_S)
#define SPI_SMEM_C_DDR_DQS_LOOP_V  0x00000001U
#define SPI_SMEM_C_DDR_DQS_LOOP_S  21
/** SPI_SMEM_C_CLK_DIFF_EN : HRO; bitpos: [24]; default: 0;
 *  Set this bit to enable the differential SPI_CLK#.
 */
#define SPI_SMEM_C_CLK_DIFF_EN    (BIT(24))
#define SPI_SMEM_C_CLK_DIFF_EN_M  (SPI_SMEM_C_CLK_DIFF_EN_V << SPI_SMEM_C_CLK_DIFF_EN_S)
#define SPI_SMEM_C_CLK_DIFF_EN_V  0x00000001U
#define SPI_SMEM_C_CLK_DIFF_EN_S  24
/** SPI_SMEM_C_DQS_CA_IN : HRO; bitpos: [26]; default: 0;
 *  Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR.
 */
#define SPI_SMEM_C_DQS_CA_IN    (BIT(26))
#define SPI_SMEM_C_DQS_CA_IN_M  (SPI_SMEM_C_DQS_CA_IN_V << SPI_SMEM_C_DQS_CA_IN_S)
#define SPI_SMEM_C_DQS_CA_IN_V  0x00000001U
#define SPI_SMEM_C_DQS_CA_IN_S  26
/** SPI_SMEM_C_HYPERBUS_DUMMY_2X : HRO; bitpos: [27]; default: 0;
 *  Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0
 *  accesses flash or SPI1 accesses flash or sram.
 */
#define SPI_SMEM_C_HYPERBUS_DUMMY_2X    (BIT(27))
#define SPI_SMEM_C_HYPERBUS_DUMMY_2X_M  (SPI_SMEM_C_HYPERBUS_DUMMY_2X_V << SPI_SMEM_C_HYPERBUS_DUMMY_2X_S)
#define SPI_SMEM_C_HYPERBUS_DUMMY_2X_V  0x00000001U
#define SPI_SMEM_C_HYPERBUS_DUMMY_2X_S  27
/** SPI_SMEM_C_CLK_DIFF_INV : HRO; bitpos: [28]; default: 0;
 *  Set this bit to invert SPI_DIFF when accesses to external RAM. .
 */
#define SPI_SMEM_C_CLK_DIFF_INV    (BIT(28))
#define SPI_SMEM_C_CLK_DIFF_INV_M  (SPI_SMEM_C_CLK_DIFF_INV_V << SPI_SMEM_C_CLK_DIFF_INV_S)
#define SPI_SMEM_C_CLK_DIFF_INV_V  0x00000001U
#define SPI_SMEM_C_CLK_DIFF_INV_S  28
/** SPI_SMEM_C_OCTA_RAM_ADDR : HRO; bitpos: [29]; default: 0;
 *  Set this bit to enable octa_ram address out when accesses to external RAM, which
 *  means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1],
 *  1'b0}.
 */
#define SPI_SMEM_C_OCTA_RAM_ADDR    (BIT(29))
#define SPI_SMEM_C_OCTA_RAM_ADDR_M  (SPI_SMEM_C_OCTA_RAM_ADDR_V << SPI_SMEM_C_OCTA_RAM_ADDR_S)
#define SPI_SMEM_C_OCTA_RAM_ADDR_V  0x00000001U
#define SPI_SMEM_C_OCTA_RAM_ADDR_S  29
/** SPI_SMEM_C_HYPERBUS_CA : HRO; bitpos: [30]; default: 0;
 *  Set this bit to enable HyperRAM address out when accesses to external RAM, which
 *  means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}.
 */
#define SPI_SMEM_C_HYPERBUS_CA    (BIT(30))
#define SPI_SMEM_C_HYPERBUS_CA_M  (SPI_SMEM_C_HYPERBUS_CA_V << SPI_SMEM_C_HYPERBUS_CA_S)
#define SPI_SMEM_C_HYPERBUS_CA_V  0x00000001U
#define SPI_SMEM_C_HYPERBUS_CA_S  30

/** SPI_MEM_C_DLL_DLY_DB_REG register
 *  MSPI DLL function and debug configuration register
 */
#define SPI_MEM_C_DLL_DLY_DB_REG (DR_REG_FLASH_SPI0_BASE + 0xdc)
/** SPI_MEM_C_DLL_DB_CFG_VLD_CNT : HRO; bitpos: [7:0]; default: 0;
 *  Configures the end time of the debug window.
 */
#define SPI_MEM_C_DLL_DB_CFG_VLD_CNT    0x000000FFU
#define SPI_MEM_C_DLL_DB_CFG_VLD_CNT_M  (SPI_MEM_C_DLL_DB_CFG_VLD_CNT_V << SPI_MEM_C_DLL_DB_CFG_VLD_CNT_S)
#define SPI_MEM_C_DLL_DB_CFG_VLD_CNT_V  0x000000FFU
#define SPI_MEM_C_DLL_DB_CFG_VLD_CNT_S  0
/** SPI_MEM_C_DLL_DB_CNT_MODE_SEL : HRO; bitpos: [11:8]; default: 0;
 *  [3]:1-spi_din[15:8]. 0-spi_din[7:0]. [2]:1-only shift wptr or rptr. 0-both shift
 *  wptr and rptr. [1]:1-wprt[3:0] and rptr[3:0]. 0-rptr[3:0] and wprt[3:0].
 *  [0]:1-neg_ptr[3:0]. 0-pos_prt[3:0].
 */
#define SPI_MEM_C_DLL_DB_CNT_MODE_SEL    0x0000000FU
#define SPI_MEM_C_DLL_DB_CNT_MODE_SEL_M  (SPI_MEM_C_DLL_DB_CNT_MODE_SEL_V << SPI_MEM_C_DLL_DB_CNT_MODE_SEL_S)
#define SPI_MEM_C_DLL_DB_CNT_MODE_SEL_V  0x0000000FU
#define SPI_MEM_C_DLL_DB_CNT_MODE_SEL_S  8
/** SPI_MEM_C_DLL_DB_CNT_CLR : HRO; bitpos: [12]; default: 0;
 *  Configures the start time of the debug window. 1: Clear db_vld_cnt to 0 and Get
 *  ready for debug. 0: No debug.
 */
#define SPI_MEM_C_DLL_DB_CNT_CLR    (BIT(12))
#define SPI_MEM_C_DLL_DB_CNT_CLR_M  (SPI_MEM_C_DLL_DB_CNT_CLR_V << SPI_MEM_C_DLL_DB_CNT_CLR_S)
#define SPI_MEM_C_DLL_DB_CNT_CLR_V  0x00000001U
#define SPI_MEM_C_DLL_DB_CNT_CLR_S  12
/** SPI_MEM_C_DLL_DIN_DLY_SEL : HRO; bitpos: [13]; default: 0;
 *  Configures the din channel. 1: Use  delayed data. 0: Do not use delayed data.
 */
#define SPI_MEM_C_DLL_DIN_DLY_SEL    (BIT(13))
#define SPI_MEM_C_DLL_DIN_DLY_SEL_M  (SPI_MEM_C_DLL_DIN_DLY_SEL_V << SPI_MEM_C_DLL_DIN_DLY_SEL_S)
#define SPI_MEM_C_DLL_DIN_DLY_SEL_V  0x00000001U
#define SPI_MEM_C_DLL_DIN_DLY_SEL_S  13

/** SPI_MEM_C_DLL_DB_ST0_REG register
 *  MSPI DLL debug status0 register
 */
#define SPI_MEM_C_DLL_DB_ST0_REG (DR_REG_FLASH_SPI0_BASE + 0xe0)
/** SPI_MEM_C_DB_FIFO_CNT_H : RO; bitpos: [31:0]; default: 0;
 *  Debug  for DLL FIFO pointer. Use a 64bits shift register to record pointer changes
 *  during the debug window. db_fifo_cnt[63:32]
 */
#define SPI_MEM_C_DB_FIFO_CNT_H    0xFFFFFFFFU
#define SPI_MEM_C_DB_FIFO_CNT_H_M  (SPI_MEM_C_DB_FIFO_CNT_H_V << SPI_MEM_C_DB_FIFO_CNT_H_S)
#define SPI_MEM_C_DB_FIFO_CNT_H_V  0xFFFFFFFFU
#define SPI_MEM_C_DB_FIFO_CNT_H_S  0

/** SPI_MEM_C_DLL_DB_ST1_REG register
 *  MSPI DLL debug status1 register
 */
#define SPI_MEM_C_DLL_DB_ST1_REG (DR_REG_FLASH_SPI0_BASE + 0xe4)
/** SPI_MEM_C_DB_FIFO_CNT_L : RO; bitpos: [31:0]; default: 0;
 *  Debug  for DLL FIFO pointer. Use a 64bits shift register to record pointer changes
 *  during the debug window. db_fifo_cnt[31:0]
 */
#define SPI_MEM_C_DB_FIFO_CNT_L    0xFFFFFFFFU
#define SPI_MEM_C_DB_FIFO_CNT_L_M  (SPI_MEM_C_DB_FIFO_CNT_L_V << SPI_MEM_C_DB_FIFO_CNT_L_S)
#define SPI_MEM_C_DB_FIFO_CNT_L_V  0xFFFFFFFFU
#define SPI_MEM_C_DB_FIFO_CNT_L_S  0

