espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_SMEM_C_PMS2_ADDR_REG register
 *  SPI1 external RAM PMS section 2 start address register
 */
#define SPI_SMEM_C_PMS2_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x148)
/** SPI_SMEM_C_PMS2_ADDR_S : HRO; bitpos: [28:0]; default: 0;
 *  SPI1 external RAM PMS section 2 start address value
 */
#define SPI_SMEM_C_PMS2_ADDR_S    0x1FFFFFFFU
#define SPI_SMEM_C_PMS2_ADDR_S_M  (SPI_SMEM_C_PMS2_ADDR_S_V << SPI_SMEM_C_PMS2_ADDR_S_S)
#define SPI_SMEM_C_PMS2_ADDR_S_V  0x1FFFFFFFU
#define SPI_SMEM_C_PMS2_ADDR_S_S  0

/** SPI_SMEM_C_PMS3_ADDR_REG register
 *  SPI1 external RAM PMS section 3 start address register
 */
#define SPI_SMEM_C_PMS3_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x14c)
/** SPI_SMEM_C_PMS3_ADDR_S : HRO; bitpos: [28:0]; default: 0;
 *  SPI1 external RAM PMS section 3 start address value
 */
#define SPI_SMEM_C_PMS3_ADDR_S    0x1FFFFFFFU
#define SPI_SMEM_C_PMS3_ADDR_S_M  (SPI_SMEM_C_PMS3_ADDR_S_V << SPI_SMEM_C_PMS3_ADDR_S_S)
#define SPI_SMEM_C_PMS3_ADDR_S_V  0x1FFFFFFFU
#define SPI_SMEM_C_PMS3_ADDR_S_S  0

/** SPI_SMEM_C_PMS0_SIZE_REG register
 *  SPI1 external RAM PMS section 0 start address register
 */
#define SPI_SMEM_C_PMS0_SIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x150)
/** SPI_SMEM_C_PMS0_SIZE : HRO; bitpos: [16:0]; default: 4096;
 *  SPI1 external RAM PMS section 0 address region is (SPI_SMEM_C_PMS0_ADDR_S,
 *  SPI_SMEM_C_PMS0_ADDR_S + SPI_SMEM_C_PMS0_SIZE)
 */
#define SPI_SMEM_C_PMS0_SIZE    0x0001FFFFU
#define SPI_SMEM_C_PMS0_SIZE_M  (SPI_SMEM_C_PMS0_SIZE_V << SPI_SMEM_C_PMS0_SIZE_S)
#define SPI_SMEM_C_PMS0_SIZE_V  0x0001FFFFU
#define SPI_SMEM_C_PMS0_SIZE_S  0

/** SPI_SMEM_C_PMS1_SIZE_REG register
 *  SPI1 external RAM PMS section 1 start address register
 */
#define SPI_SMEM_C_PMS1_SIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x154)
/** SPI_SMEM_C_PMS1_SIZE : HRO; bitpos: [16:0]; default: 4096;
 *  SPI1 external RAM PMS section 1 address region is (SPI_SMEM_C_PMS1_ADDR_S,
 *  SPI_SMEM_C_PMS1_ADDR_S + SPI_SMEM_C_PMS1_SIZE)
 */
#define SPI_SMEM_C_PMS1_SIZE    0x0001FFFFU
#define SPI_SMEM_C_PMS1_SIZE_M  (SPI_SMEM_C_PMS1_SIZE_V << SPI_SMEM_C_PMS1_SIZE_S)
#define SPI_SMEM_C_PMS1_SIZE_V  0x0001FFFFU
#define SPI_SMEM_C_PMS1_SIZE_S  0

/** SPI_SMEM_C_PMS2_SIZE_REG register
 *  SPI1 external RAM PMS section 2 start address register
 */
#define SPI_SMEM_C_PMS2_SIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x158)
/** SPI_SMEM_C_PMS2_SIZE : HRO; bitpos: [16:0]; default: 4096;
 *  SPI1 external RAM PMS section 2 address region is (SPI_SMEM_C_PMS2_ADDR_S,
 *  SPI_SMEM_C_PMS2_ADDR_S + SPI_SMEM_C_PMS2_SIZE)
 */
#define SPI_SMEM_C_PMS2_SIZE    0x0001FFFFU
#define SPI_SMEM_C_PMS2_SIZE_M  (SPI_SMEM_C_PMS2_SIZE_V << SPI_SMEM_C_PMS2_SIZE_S)
#define SPI_SMEM_C_PMS2_SIZE_V  0x0001FFFFU
#define SPI_SMEM_C_PMS2_SIZE_S  0

/** SPI_SMEM_C_PMS3_SIZE_REG register
 *  SPI1 external RAM PMS section 3 start address register
 */
#define SPI_SMEM_C_PMS3_SIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x15c)
/** SPI_SMEM_C_PMS3_SIZE : HRO; bitpos: [16:0]; default: 4096;
 *  SPI1 external RAM PMS section 3 address region is (SPI_SMEM_C_PMS3_ADDR_S,
 *  SPI_SMEM_C_PMS3_ADDR_S + SPI_SMEM_C_PMS3_SIZE)
 */
#define SPI_SMEM_C_PMS3_SIZE    0x0001FFFFU
#define SPI_SMEM_C_PMS3_SIZE_M  (SPI_SMEM_C_PMS3_SIZE_V << SPI_SMEM_C_PMS3_SIZE_S)
#define SPI_SMEM_C_PMS3_SIZE_V  0x0001FFFFU
#define SPI_SMEM_C_PMS3_SIZE_S  0

/** SPI_MEM_C_PMS_REJECT_REG register
 *  SPI1 access reject register
 */
#define SPI_MEM_C_PMS_REJECT_REG (DR_REG_FLASH_SPI0_BASE + 0x160)
/** SPI_MEM_C_PM_EN : R/W; bitpos: [27]; default: 0;
 *  Set this bit to enable SPI0/1 transfer permission control function.
 */
#define SPI_MEM_C_PM_EN    (BIT(27))
#define SPI_MEM_C_PM_EN_M  (SPI_MEM_C_PM_EN_V << SPI_MEM_C_PM_EN_S)
#define SPI_MEM_C_PM_EN_V  0x00000001U
#define SPI_MEM_C_PM_EN_S  27
/** SPI_MEM_C_PMS_LD : R/SS/WTC; bitpos: [28]; default: 0;
 *  1: SPI1 write access error. 0: No write access error. It is cleared by when
 *  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_PMS_LD    (BIT(28))
#define SPI_MEM_C_PMS_LD_M  (SPI_MEM_C_PMS_LD_V << SPI_MEM_C_PMS_LD_S)
#define SPI_MEM_C_PMS_LD_V  0x00000001U
#define SPI_MEM_C_PMS_LD_S  28
/** SPI_MEM_C_PMS_ST : R/SS/WTC; bitpos: [29]; default: 0;
 *  1: SPI1 read access error. 0: No read access error. It is cleared by when
 *  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_PMS_ST    (BIT(29))
#define SPI_MEM_C_PMS_ST_M  (SPI_MEM_C_PMS_ST_V << SPI_MEM_C_PMS_ST_S)
#define SPI_MEM_C_PMS_ST_V  0x00000001U
#define SPI_MEM_C_PMS_ST_S  29
/** SPI_MEM_C_PMS_MULTI_HIT : R/SS/WTC; bitpos: [30]; default: 0;
 *  1: SPI1 access is rejected because of address miss. 0: No address miss error. It is
 *  cleared by when  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_PMS_MULTI_HIT    (BIT(30))
#define SPI_MEM_C_PMS_MULTI_HIT_M  (SPI_MEM_C_PMS_MULTI_HIT_V << SPI_MEM_C_PMS_MULTI_HIT_S)
#define SPI_MEM_C_PMS_MULTI_HIT_V  0x00000001U
#define SPI_MEM_C_PMS_MULTI_HIT_S  30
/** SPI_MEM_C_PMS_IVD : R/SS/WTC; bitpos: [31]; default: 0;
 *  1: SPI1 access is rejected because of address multi-hit. 0: No address multi-hit
 *  error. It is cleared by when  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_PMS_IVD    (BIT(31))
#define SPI_MEM_C_PMS_IVD_M  (SPI_MEM_C_PMS_IVD_V << SPI_MEM_C_PMS_IVD_S)
#define SPI_MEM_C_PMS_IVD_V  0x00000001U
#define SPI_MEM_C_PMS_IVD_S  31

/** SPI_MEM_C_PMS_REJECT_ADDR_REG register
 *  SPI1 access reject addr register
 */
#define SPI_MEM_C_PMS_REJECT_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x164)
/** SPI_MEM_C_REJECT_ADDR : R/SS/WTC; bitpos: [28:0]; default: 0;
 *  This bits show the first SPI1 access error address. It is cleared by when
 *  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_REJECT_ADDR    0x1FFFFFFFU
#define SPI_MEM_C_REJECT_ADDR_M  (SPI_MEM_C_REJECT_ADDR_V << SPI_MEM_C_REJECT_ADDR_S)
#define SPI_MEM_C_REJECT_ADDR_V  0x1FFFFFFFU
#define SPI_MEM_C_REJECT_ADDR_S  0

/** SPI_MEM_C_ECC_CTRL_REG register
 *  MSPI ECC control register
 */
#define SPI_MEM_C_ECC_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x168)
/** SPI_MEM_C_ECC_ERR_CNT : HRO; bitpos: [10:5]; default: 0;
 *  This bits show the error times of MSPI ECC read. It is cleared by when
 *  SPI_MEM_C_ECC_ERR_INT_CLR bit is set.
 */
#define SPI_MEM_C_ECC_ERR_CNT    0x0000003FU
#define SPI_MEM_C_ECC_ERR_CNT_M  (SPI_MEM_C_ECC_ERR_CNT_V << SPI_MEM_C_ECC_ERR_CNT_S)
#define SPI_MEM_C_ECC_ERR_CNT_V  0x0000003FU
#define SPI_MEM_C_ECC_ERR_CNT_S  5
/** SPI_FMEM_C_ECC_ERR_INT_NUM : HRO; bitpos: [16:11]; default: 10;
 *  Set the error times of MSPI ECC read to generate MSPI SPI_MEM_C_ECC_ERR_INT interrupt.
 */
#define SPI_FMEM_C_ECC_ERR_INT_NUM    0x0000003FU
#define SPI_FMEM_C_ECC_ERR_INT_NUM_M  (SPI_FMEM_C_ECC_ERR_INT_NUM_V << SPI_FMEM_C_ECC_ERR_INT_NUM_S)
#define SPI_FMEM_C_ECC_ERR_INT_NUM_V  0x0000003FU
#define SPI_FMEM_C_ECC_ERR_INT_NUM_S  11
/** SPI_FMEM_C_ECC_ERR_INT_EN : HRO; bitpos: [17]; default: 0;
 *  Set this bit to calculate the error times of MSPI ECC read when accesses to flash.
 */
#define SPI_FMEM_C_ECC_ERR_INT_EN    (BIT(17))
#define SPI_FMEM_C_ECC_ERR_INT_EN_M  (SPI_FMEM_C_ECC_ERR_INT_EN_V << SPI_FMEM_C_ECC_ERR_INT_EN_S)
#define SPI_FMEM_C_ECC_ERR_INT_EN_V  0x00000001U
#define SPI_FMEM_C_ECC_ERR_INT_EN_S  17
/** SPI_FMEM_C_PAGE_SIZE : R/W; bitpos: [20:18]; default: 0;
 *  Set the page size of the flash accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2:
 *  1024 bytes. 3: 2048 bytes. 4: 4096 bytes.
 */
#define SPI_FMEM_C_PAGE_SIZE    0x00000007U
#define SPI_FMEM_C_PAGE_SIZE_M  (SPI_FMEM_C_PAGE_SIZE_V << SPI_FMEM_C_PAGE_SIZE_S)
#define SPI_FMEM_C_PAGE_SIZE_V  0x00000007U
#define SPI_FMEM_C_PAGE_SIZE_S  18
/** SPI_FMEM_C_ECC_ADDR_EN : HRO; bitpos: [21]; default: 0;
 *  Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the
 *  ECC region or non-ECC region of flash. If there is no ECC region in flash, this bit
 *  should be 0. Otherwise, this bit should be 1.
 */
#define SPI_FMEM_C_ECC_ADDR_EN    (BIT(21))
#define SPI_FMEM_C_ECC_ADDR_EN_M  (SPI_FMEM_C_ECC_ADDR_EN_V << SPI_FMEM_C_ECC_ADDR_EN_S)
#define SPI_FMEM_C_ECC_ADDR_EN_V  0x00000001U
#define SPI_FMEM_C_ECC_ADDR_EN_S  21
/** SPI_MEM_C_USR_ECC_ADDR_EN : HRO; bitpos: [22]; default: 0;
 *  Set this bit to enable ECC address convert in SPI0/1 USR_CMD transfer.
 */
#define SPI_MEM_C_USR_ECC_ADDR_EN    (BIT(22))
#define SPI_MEM_C_USR_ECC_ADDR_EN_M  (SPI_MEM_C_USR_ECC_ADDR_EN_V << SPI_MEM_C_USR_ECC_ADDR_EN_S)
#define SPI_MEM_C_USR_ECC_ADDR_EN_V  0x00000001U
#define SPI_MEM_C_USR_ECC_ADDR_EN_S  22
/** SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN : HRO; bitpos: [24]; default: 1;
 *  1: The error information in SPI_MEM_C_ECC_ERR_BITS and SPI_MEM_C_ECC_ERR_ADDR is
 *  updated when there is an ECC error. 0: SPI_MEM_C_ECC_ERR_BITS and
 *  SPI_MEM_C_ECC_ERR_ADDR record the first ECC error information.
 */
#define SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN    (BIT(24))
#define SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_M  (SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_V << SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_S)
#define SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_V  0x00000001U
#define SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_S  24
/** SPI_MEM_C_ECC_ERR_BITS : HRO; bitpos: [31:25]; default: 0;
 *  Records the first ECC error bit number in the 16 bytes(From 0~127, corresponding to
 *  byte 0 bit 0 to byte 15 bit 7)
 */
#define SPI_MEM_C_ECC_ERR_BITS    0x0000007FU
#define SPI_MEM_C_ECC_ERR_BITS_M  (SPI_MEM_C_ECC_ERR_BITS_V << SPI_MEM_C_ECC_ERR_BITS_S)
#define SPI_MEM_C_ECC_ERR_BITS_V  0x0000007FU
#define SPI_MEM_C_ECC_ERR_BITS_S  25

/** SPI_MEM_C_ECC_ERR_ADDR_REG register
 *  MSPI ECC error address register
 */
#define SPI_MEM_C_ECC_ERR_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x16c)
/** SPI_MEM_C_ECC_ERR_ADDR : HRO; bitpos: [28:0]; default: 0;
 *  This bits show the first MSPI ECC error address. It is cleared by when
 *  SPI_MEM_C_ECC_ERR_INT_CLR bit is set.
 */
#define SPI_MEM_C_ECC_ERR_ADDR    0x1FFFFFFFU
#define SPI_MEM_C_ECC_ERR_ADDR_M  (SPI_MEM_C_ECC_ERR_ADDR_V << SPI_MEM_C_ECC_ERR_ADDR_S)
#define SPI_MEM_C_ECC_ERR_ADDR_V  0x1FFFFFFFU
#define SPI_MEM_C_ECC_ERR_ADDR_S  0

/** SPI_MEM_C_AXI_ERR_ADDR_REG register
 *  SPI0 AXI request error address.
 */
#define SPI_MEM_C_AXI_ERR_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x170)
/** SPI_MEM_C_AXI_ERR_ADDR : R/SS/WTC; bitpos: [28:0]; default: 0;
 *  This bits show the first AXI write/read invalid error or AXI write flash error
 *  address. It is cleared by when SPI_MEM_C_AXI_WADDR_ERR_INT_CLR,
 *  SPI_MEM_C_AXI_WR_FLASH_ERR_IN_CLR or SPI_MEM_C_AXI_RADDR_ERR_IN_CLR bit is set.
 */
#define SPI_MEM_C_AXI_ERR_ADDR    0x1FFFFFFFU
#define SPI_MEM_C_AXI_ERR_ADDR_M  (SPI_MEM_C_AXI_ERR_ADDR_V << SPI_MEM_C_AXI_ERR_ADDR_S)
#define SPI_MEM_C_AXI_ERR_ADDR_V  0x1FFFFFFFU
#define SPI_MEM_C_AXI_ERR_ADDR_S  0

/** SPI_SMEM_C_ECC_CTRL_REG register
 *  MSPI ECC control register
 */
#define SPI_SMEM_C_ECC_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x174)
/** SPI_SMEM_C_ECC_ERR_INT_EN : HRO; bitpos: [17]; default: 0;
 *  Set this bit to calculate the error times of MSPI ECC read when accesses to
 *  external RAM.
 */
#define SPI_SMEM_C_ECC_ERR_INT_EN    (BIT(17))
#define SPI_SMEM_C_ECC_ERR_INT_EN_M  (SPI_SMEM_C_ECC_ERR_INT_EN_V << SPI_SMEM_C_ECC_ERR_INT_EN_S)
#define SPI_SMEM_C_ECC_ERR_INT_EN_V  0x00000001U
#define SPI_SMEM_C_ECC_ERR_INT_EN_S  17
/** SPI_SMEM_C_PAGE_SIZE : HRO; bitpos: [19:18]; default: 2;
 *  Set the page size of the external RAM accessed by MSPI. 0: 256 bytes. 1: 512 bytes.
 *  2: 1024 bytes. 3: 2048 bytes.
 */
#define SPI_SMEM_C_PAGE_SIZE    0x00000003U
#define SPI_SMEM_C_PAGE_SIZE_M  (SPI_SMEM_C_PAGE_SIZE_V << SPI_SMEM_C_PAGE_SIZE_S)
#define SPI_SMEM_C_PAGE_SIZE_V  0x00000003U
#define SPI_SMEM_C_PAGE_SIZE_S  18
/** SPI_SMEM_C_ECC_ADDR_EN : HRO; bitpos: [20]; default: 0;
 *  Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the
 *  ECC region or non-ECC region of external RAM. If there is no ECC region in external
 *  RAM, this bit should be 0. Otherwise, this bit should be 1.
 */
#define SPI_SMEM_C_ECC_ADDR_EN    (BIT(20))
#define SPI_SMEM_C_ECC_ADDR_EN_M  (SPI_SMEM_C_ECC_ADDR_EN_V << SPI_SMEM_C_ECC_ADDR_EN_S)
#define SPI_SMEM_C_ECC_ADDR_EN_V  0x00000001U
#define SPI_SMEM_C_ECC_ADDR_EN_S  20

/** SPI_SMEM_C_AXI_ADDR_CTRL_REG register
 *  SPI0 AXI address control register
 */
#define SPI_SMEM_C_AXI_ADDR_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x178)
/** SPI_MEM_C_ALL_FIFO_EMPTY : RO; bitpos: [26]; default: 1;
 *  The empty status of all AFIFO and SYNC_FIFO in MSPI module. 1: All AXI transfers
 *  and SPI0 transfers are done. 0: Others.
 */
#define SPI_MEM_C_ALL_FIFO_EMPTY    (BIT(26))
#define SPI_MEM_C_ALL_FIFO_EMPTY_M  (SPI_MEM_C_ALL_FIFO_EMPTY_V << SPI_MEM_C_ALL_FIFO_EMPTY_S)
#define SPI_MEM_C_ALL_FIFO_EMPTY_V  0x00000001U
#define SPI_MEM_C_ALL_FIFO_EMPTY_S  26
/** SPI_RDATA_AFIFO_REMPTY : RO; bitpos: [27]; default: 1;
 *  1: RDATA_AFIFO is empty. 0: At least one AXI read transfer is pending.
 */
#define SPI_RDATA_AFIFO_REMPTY    (BIT(27))
#define SPI_RDATA_AFIFO_REMPTY_M  (SPI_RDATA_AFIFO_REMPTY_V << SPI_RDATA_AFIFO_REMPTY_S)
#define SPI_RDATA_AFIFO_REMPTY_V  0x00000001U
#define SPI_RDATA_AFIFO_REMPTY_S  27
/** SPI_RADDR_AFIFO_REMPTY : RO; bitpos: [28]; default: 1;
 *  1: AXI_RADDR_CTL_AFIFO is empty. 0: At least one AXI read transfer is pending.
 */
#define SPI_RADDR_AFIFO_REMPTY    (BIT(28))
#define SPI_RADDR_AFIFO_REMPTY_M  (SPI_RADDR_AFIFO_REMPTY_V << SPI_RADDR_AFIFO_REMPTY_S)
#define SPI_RADDR_AFIFO_REMPTY_V  0x00000001U
#define SPI_RADDR_AFIFO_REMPTY_S  28
/** SPI_WDATA_AFIFO_REMPTY : RO; bitpos: [29]; default: 1;
 *  1: WDATA_AFIFO is empty. 0: At least one AXI write transfer is pending.
 */
#define SPI_WDATA_AFIFO_REMPTY    (BIT(29))
#define SPI_WDATA_AFIFO_REMPTY_M  (SPI_WDATA_AFIFO_REMPTY_V << SPI_WDATA_AFIFO_REMPTY_S)
#define SPI_WDATA_AFIFO_REMPTY_V  0x00000001U
#define SPI_WDATA_AFIFO_REMPTY_S  29
/** SPI_WBLEN_AFIFO_REMPTY : RO; bitpos: [30]; default: 1;
 *  1: WBLEN_AFIFO is empty. 0: At least one AXI write transfer is pending.
 */
#define SPI_WBLEN_AFIFO_REMPTY    (BIT(30))
#define SPI_WBLEN_AFIFO_REMPTY_M  (SPI_WBLEN_AFIFO_REMPTY_V << SPI_WBLEN_AFIFO_REMPTY_S)
#define SPI_WBLEN_AFIFO_REMPTY_V  0x00000001U
#define SPI_WBLEN_AFIFO_REMPTY_S  30
/** SPI_ALL_AXI_TRANS_AFIFO_EMPTY : RO; bitpos: [31]; default: 1;
 *  This bit is set when WADDR_AFIFO, WBLEN_AFIFO, WDATA_AFIFO, AXI_RADDR_CTL_AFIFO and
 *  RDATA_AFIFO are empty and spi0_mst_st is IDLE.
 */
#define SPI_ALL_AXI_TRANS_AFIFO_EMPTY    (BIT(31))
#define SPI_ALL_AXI_TRANS_AFIFO_EMPTY_M  (SPI_ALL_AXI_TRANS_AFIFO_EMPTY_V << SPI_ALL_AXI_TRANS_AFIFO_EMPTY_S)
#define SPI_ALL_AXI_TRANS_AFIFO_EMPTY_V  0x00000001U
#define SPI_ALL_AXI_TRANS_AFIFO_EMPTY_S  31

/** SPI_MEM_C_AXI_ERR_RESP_EN_REG register
 *  SPI0 AXI error response enable register
 */
#define SPI_MEM_C_AXI_ERR_RESP_EN_REG (DR_REG_FLASH_SPI0_BASE + 0x17c)
/** SPI_MEM_C_AW_RESP_EN_MMU_VLD : R/W; bitpos: [0]; default: 0;
 *  Set this bit  to enable AXI response function for mmu valid err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_MMU_VLD    (BIT(0))
#define SPI_MEM_C_AW_RESP_EN_MMU_VLD_M  (SPI_MEM_C_AW_RESP_EN_MMU_VLD_V << SPI_MEM_C_AW_RESP_EN_MMU_VLD_S)
#define SPI_MEM_C_AW_RESP_EN_MMU_VLD_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_MMU_VLD_S  0
/** SPI_MEM_C_AW_RESP_EN_MMU_GID : R/W; bitpos: [1]; default: 0;
 *  Set this bit  to enable AXI response function for mmu gid err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_MMU_GID    (BIT(1))
#define SPI_MEM_C_AW_RESP_EN_MMU_GID_M  (SPI_MEM_C_AW_RESP_EN_MMU_GID_V << SPI_MEM_C_AW_RESP_EN_MMU_GID_S)
#define SPI_MEM_C_AW_RESP_EN_MMU_GID_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_MMU_GID_S  1
/** SPI_MEM_C_AW_RESP_EN_AXI_SIZE : R/W; bitpos: [2]; default: 0;
 *  Set this bit  to enable AXI response function for axi size err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_AXI_SIZE    (BIT(2))
#define SPI_MEM_C_AW_RESP_EN_AXI_SIZE_M  (SPI_MEM_C_AW_RESP_EN_AXI_SIZE_V << SPI_MEM_C_AW_RESP_EN_AXI_SIZE_S)
#define SPI_MEM_C_AW_RESP_EN_AXI_SIZE_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_AXI_SIZE_S  2
/** SPI_MEM_C_AW_RESP_EN_AXI_FLASH : R/W; bitpos: [3]; default: 0;
 *  Set this bit  to enable AXI response function for axi flash err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_AXI_FLASH    (BIT(3))
#define SPI_MEM_C_AW_RESP_EN_AXI_FLASH_M  (SPI_MEM_C_AW_RESP_EN_AXI_FLASH_V << SPI_MEM_C_AW_RESP_EN_AXI_FLASH_S)
#define SPI_MEM_C_AW_RESP_EN_AXI_FLASH_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_AXI_FLASH_S  3
/** SPI_MEM_C_AW_RESP_EN_MMU_ECC : R/W; bitpos: [4]; default: 0;
 *  Set this bit  to enable AXI response function for mmu ecc err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_MMU_ECC    (BIT(4))
#define SPI_MEM_C_AW_RESP_EN_MMU_ECC_M  (SPI_MEM_C_AW_RESP_EN_MMU_ECC_V << SPI_MEM_C_AW_RESP_EN_MMU_ECC_S)
#define SPI_MEM_C_AW_RESP_EN_MMU_ECC_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_MMU_ECC_S  4
/** SPI_MEM_C_AW_RESP_EN_MMU_SENS : R/W; bitpos: [5]; default: 0;
 *  Set this bit  to enable AXI response function for mmu sens in err axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_MMU_SENS    (BIT(5))
#define SPI_MEM_C_AW_RESP_EN_MMU_SENS_M  (SPI_MEM_C_AW_RESP_EN_MMU_SENS_V << SPI_MEM_C_AW_RESP_EN_MMU_SENS_S)
#define SPI_MEM_C_AW_RESP_EN_MMU_SENS_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_MMU_SENS_S  5
/** SPI_MEM_C_AW_RESP_EN_AXI_WSTRB : R/W; bitpos: [6]; default: 0;
 *  Set this bit  to enable AXI response function for axi wstrb err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_AXI_WSTRB    (BIT(6))
#define SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_M  (SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_V << SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_S)
#define SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_S  6
/** SPI_MEM_C_AR_RESP_EN_MMU_VLD : R/W; bitpos: [7]; default: 0;
 *  Set this bit  to enable AXI response function for mmu valid err in axi read trans.
 */
#define SPI_MEM_C_AR_RESP_EN_MMU_VLD    (BIT(7))
#define SPI_MEM_C_AR_RESP_EN_MMU_VLD_M  (SPI_MEM_C_AR_RESP_EN_MMU_VLD_V << SPI_MEM_C_AR_RESP_EN_MMU_VLD_S)
#define SPI_MEM_C_AR_RESP_EN_MMU_VLD_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_MMU_VLD_S  7
/** SPI_MEM_C_AR_RESP_EN_MMU_GID : R/W; bitpos: [8]; default: 0;
 *  Set this bit  to enable AXI response function for mmu gid err in axi read trans.
 */
#define SPI_MEM_C_AR_RESP_EN_MMU_GID    (BIT(8))
#define SPI_MEM_C_AR_RESP_EN_MMU_GID_M  (SPI_MEM_C_AR_RESP_EN_MMU_GID_V << SPI_MEM_C_AR_RESP_EN_MMU_GID_S)
#define SPI_MEM_C_AR_RESP_EN_MMU_GID_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_MMU_GID_S  8
/** SPI_MEM_C_AR_RESP_EN_MMU_ECC : R/W; bitpos: [9]; default: 0;
 *  Set this bit  to enable AXI response function for mmu ecc err in axi read trans.
 */
#define SPI_MEM_C_AR_RESP_EN_MMU_ECC    (BIT(9))
#define SPI_MEM_C_AR_RESP_EN_MMU_ECC_M  (SPI_MEM_C_AR_RESP_EN_MMU_ECC_V << SPI_MEM_C_AR_RESP_EN_MMU_ECC_S)
#define SPI_MEM_C_AR_RESP_EN_MMU_ECC_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_MMU_ECC_S  9
/** SPI_MEM_C_AR_RESP_EN_MMU_SENS : R/W; bitpos: [10]; default: 0;
 *  Set this bit  to enable AXI response function for mmu sensitive err in axi read
 *  trans.
 */
#define SPI_MEM_C_AR_RESP_EN_MMU_SENS    (BIT(10))
#define SPI_MEM_C_AR_RESP_EN_MMU_SENS_M  (SPI_MEM_C_AR_RESP_EN_MMU_SENS_V << SPI_MEM_C_AR_RESP_EN_MMU_SENS_S)
#define SPI_MEM_C_AR_RESP_EN_MMU_SENS_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_MMU_SENS_S  10
/** SPI_MEM_C_AR_RESP_EN_AXI_SIZE : R/W; bitpos: [11]; default: 0;
 *  Set this bit  to enable AXI response function for axi size err in axi read trans.
 */
#define SPI_MEM_C_AR_RESP_EN_AXI_SIZE    (BIT(11))
#define SPI_MEM_C_AR_RESP_EN_AXI_SIZE_M  (SPI_MEM_C_AR_RESP_EN_AXI_SIZE_V << SPI_MEM_C_AR_RESP_EN_AXI_SIZE_S)
#define SPI_MEM_C_AR_RESP_EN_AXI_SIZE_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_AXI_SIZE_S  11

/** SPI_MEM_C_TIMING_CALI_REG register
 *  SPI0 flash timing calibration register
 */
#define SPI_MEM_C_TIMING_CALI_REG (DR_REG_FLASH_SPI0_BASE + 0x180)
/** SPI_MEM_C_TIMING_CLK_ENA : R/W; bitpos: [0]; default: 1;
 *  The bit is used to enable timing adjust clock for all reading operations.
 */
#define SPI_MEM_C_TIMING_CLK_ENA    (BIT(0))
#define SPI_MEM_C_TIMING_CLK_ENA_M  (SPI_MEM_C_TIMING_CLK_ENA_V << SPI_MEM_C_TIMING_CLK_ENA_S)
#define SPI_MEM_C_TIMING_CLK_ENA_V  0x00000001U
#define SPI_MEM_C_TIMING_CLK_ENA_S  0
/** SPI_MEM_C_TIMING_CALI : R/W; bitpos: [1]; default: 0;
 *  The bit is used to enable timing auto-calibration for all reading operations.
 */
#define SPI_MEM_C_TIMING_CALI    (BIT(1))
#define SPI_MEM_C_TIMING_CALI_M  (SPI_MEM_C_TIMING_CALI_V << SPI_MEM_C_TIMING_CALI_S)
#define SPI_MEM_C_TIMING_CALI_V  0x00000001U
#define SPI_MEM_C_TIMING_CALI_S  1
/** SPI_MEM_C_EXTRA_DUMMY_CYCLELEN : R/W; bitpos: [4:2]; default: 0;
 *  add extra dummy spi clock cycle length for spi clock calibration.
 */
#define SPI_MEM_C_EXTRA_DUMMY_CYCLELEN    0x00000007U
#define SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_M  (SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_V << SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_S)
#define SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_V  0x00000007U
#define SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_S  2
/** SPI_MEM_C_DLL_TIMING_CALI : HRO; bitpos: [5]; default: 0;
 *  Set this bit to enable DLL for timing calibration in DDR mode when accessed to
 *  flash.
 */
#define SPI_MEM_C_DLL_TIMING_CALI    (BIT(5))
#define SPI_MEM_C_DLL_TIMING_CALI_M  (SPI_MEM_C_DLL_TIMING_CALI_V << SPI_MEM_C_DLL_TIMING_CALI_S)
#define SPI_MEM_C_DLL_TIMING_CALI_V  0x00000001U
#define SPI_MEM_C_DLL_TIMING_CALI_S  5
/** SPI_MEM_C_TIMING_CALI_UPDATE : WT; bitpos: [6]; default: 0;
 *  Set this bit to update delay mode, delay num and extra dummy in MSPI.
 */
#define SPI_MEM_C_TIMING_CALI_UPDATE    (BIT(6))
#define SPI_MEM_C_TIMING_CALI_UPDATE_M  (SPI_MEM_C_TIMING_CALI_UPDATE_V << SPI_MEM_C_TIMING_CALI_UPDATE_S)
#define SPI_MEM_C_TIMING_CALI_UPDATE_V  0x00000001U
#define SPI_MEM_C_TIMING_CALI_UPDATE_S  6

