espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_DIN_MODE_REG register
 *  MSPI flash input timing delay mode control register
 */
#define SPI_MEM_C_DIN_MODE_REG (DR_REG_FLASH_SPI0_BASE + 0x184)
/** SPI_MEM_C_DIN0_MODE : R/W; bitpos: [2:0]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_C_DIN0_MODE    0x00000007U
#define SPI_MEM_C_DIN0_MODE_M  (SPI_MEM_C_DIN0_MODE_V << SPI_MEM_C_DIN0_MODE_S)
#define SPI_MEM_C_DIN0_MODE_V  0x00000007U
#define SPI_MEM_C_DIN0_MODE_S  0
/** SPI_MEM_C_DIN1_MODE : R/W; bitpos: [5:3]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_C_DIN1_MODE    0x00000007U
#define SPI_MEM_C_DIN1_MODE_M  (SPI_MEM_C_DIN1_MODE_V << SPI_MEM_C_DIN1_MODE_S)
#define SPI_MEM_C_DIN1_MODE_V  0x00000007U
#define SPI_MEM_C_DIN1_MODE_S  3
/** SPI_MEM_C_DIN2_MODE : R/W; bitpos: [8:6]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_C_DIN2_MODE    0x00000007U
#define SPI_MEM_C_DIN2_MODE_M  (SPI_MEM_C_DIN2_MODE_V << SPI_MEM_C_DIN2_MODE_S)
#define SPI_MEM_C_DIN2_MODE_V  0x00000007U
#define SPI_MEM_C_DIN2_MODE_S  6
/** SPI_MEM_C_DIN3_MODE : R/W; bitpos: [11:9]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_C_DIN3_MODE    0x00000007U
#define SPI_MEM_C_DIN3_MODE_M  (SPI_MEM_C_DIN3_MODE_V << SPI_MEM_C_DIN3_MODE_S)
#define SPI_MEM_C_DIN3_MODE_V  0x00000007U
#define SPI_MEM_C_DIN3_MODE_S  9
/** SPI_MEM_C_DIN4_MODE : R/W; bitpos: [14:12]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DIN4_MODE    0x00000007U
#define SPI_MEM_C_DIN4_MODE_M  (SPI_MEM_C_DIN4_MODE_V << SPI_MEM_C_DIN4_MODE_S)
#define SPI_MEM_C_DIN4_MODE_V  0x00000007U
#define SPI_MEM_C_DIN4_MODE_S  12
/** SPI_MEM_C_DIN5_MODE : R/W; bitpos: [17:15]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DIN5_MODE    0x00000007U
#define SPI_MEM_C_DIN5_MODE_M  (SPI_MEM_C_DIN5_MODE_V << SPI_MEM_C_DIN5_MODE_S)
#define SPI_MEM_C_DIN5_MODE_V  0x00000007U
#define SPI_MEM_C_DIN5_MODE_S  15
/** SPI_MEM_C_DIN6_MODE : R/W; bitpos: [20:18]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DIN6_MODE    0x00000007U
#define SPI_MEM_C_DIN6_MODE_M  (SPI_MEM_C_DIN6_MODE_V << SPI_MEM_C_DIN6_MODE_S)
#define SPI_MEM_C_DIN6_MODE_V  0x00000007U
#define SPI_MEM_C_DIN6_MODE_S  18
/** SPI_MEM_C_DIN7_MODE : R/W; bitpos: [23:21]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DIN7_MODE    0x00000007U
#define SPI_MEM_C_DIN7_MODE_M  (SPI_MEM_C_DIN7_MODE_V << SPI_MEM_C_DIN7_MODE_S)
#define SPI_MEM_C_DIN7_MODE_V  0x00000007U
#define SPI_MEM_C_DIN7_MODE_S  21
/** SPI_MEM_C_DINS_MODE : R/W; bitpos: [26:24]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DINS_MODE    0x00000007U
#define SPI_MEM_C_DINS_MODE_M  (SPI_MEM_C_DINS_MODE_V << SPI_MEM_C_DINS_MODE_S)
#define SPI_MEM_C_DINS_MODE_V  0x00000007U
#define SPI_MEM_C_DINS_MODE_S  24

/** SPI_MEM_C_DIN_NUM_REG register
 *  MSPI flash input timing delay number control register
 */
#define SPI_MEM_C_DIN_NUM_REG (DR_REG_FLASH_SPI0_BASE + 0x188)
/** SPI_MEM_C_DIN0_NUM : R/W; bitpos: [1:0]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DIN0_NUM    0x00000003U
#define SPI_MEM_C_DIN0_NUM_M  (SPI_MEM_C_DIN0_NUM_V << SPI_MEM_C_DIN0_NUM_S)
#define SPI_MEM_C_DIN0_NUM_V  0x00000003U
#define SPI_MEM_C_DIN0_NUM_S  0
/** SPI_MEM_C_DIN1_NUM : R/W; bitpos: [3:2]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DIN1_NUM    0x00000003U
#define SPI_MEM_C_DIN1_NUM_M  (SPI_MEM_C_DIN1_NUM_V << SPI_MEM_C_DIN1_NUM_S)
#define SPI_MEM_C_DIN1_NUM_V  0x00000003U
#define SPI_MEM_C_DIN1_NUM_S  2
/** SPI_MEM_C_DIN2_NUM : R/W; bitpos: [5:4]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DIN2_NUM    0x00000003U
#define SPI_MEM_C_DIN2_NUM_M  (SPI_MEM_C_DIN2_NUM_V << SPI_MEM_C_DIN2_NUM_S)
#define SPI_MEM_C_DIN2_NUM_V  0x00000003U
#define SPI_MEM_C_DIN2_NUM_S  4
/** SPI_MEM_C_DIN3_NUM : R/W; bitpos: [7:6]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DIN3_NUM    0x00000003U
#define SPI_MEM_C_DIN3_NUM_M  (SPI_MEM_C_DIN3_NUM_V << SPI_MEM_C_DIN3_NUM_S)
#define SPI_MEM_C_DIN3_NUM_V  0x00000003U
#define SPI_MEM_C_DIN3_NUM_S  6
/** SPI_MEM_C_DIN4_NUM : R/W; bitpos: [9:8]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DIN4_NUM    0x00000003U
#define SPI_MEM_C_DIN4_NUM_M  (SPI_MEM_C_DIN4_NUM_V << SPI_MEM_C_DIN4_NUM_S)
#define SPI_MEM_C_DIN4_NUM_V  0x00000003U
#define SPI_MEM_C_DIN4_NUM_S  8
/** SPI_MEM_C_DIN5_NUM : R/W; bitpos: [11:10]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DIN5_NUM    0x00000003U
#define SPI_MEM_C_DIN5_NUM_M  (SPI_MEM_C_DIN5_NUM_V << SPI_MEM_C_DIN5_NUM_S)
#define SPI_MEM_C_DIN5_NUM_V  0x00000003U
#define SPI_MEM_C_DIN5_NUM_S  10
/** SPI_MEM_C_DIN6_NUM : R/W; bitpos: [13:12]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DIN6_NUM    0x00000003U
#define SPI_MEM_C_DIN6_NUM_M  (SPI_MEM_C_DIN6_NUM_V << SPI_MEM_C_DIN6_NUM_S)
#define SPI_MEM_C_DIN6_NUM_V  0x00000003U
#define SPI_MEM_C_DIN6_NUM_S  12
/** SPI_MEM_C_DIN7_NUM : R/W; bitpos: [15:14]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DIN7_NUM    0x00000003U
#define SPI_MEM_C_DIN7_NUM_M  (SPI_MEM_C_DIN7_NUM_V << SPI_MEM_C_DIN7_NUM_S)
#define SPI_MEM_C_DIN7_NUM_V  0x00000003U
#define SPI_MEM_C_DIN7_NUM_S  14
/** SPI_MEM_C_DINS_NUM : R/W; bitpos: [17:16]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_C_DINS_NUM    0x00000003U
#define SPI_MEM_C_DINS_NUM_M  (SPI_MEM_C_DINS_NUM_V << SPI_MEM_C_DINS_NUM_S)
#define SPI_MEM_C_DINS_NUM_V  0x00000003U
#define SPI_MEM_C_DINS_NUM_S  16

