espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_SMEM_C_AC_REG register
 *  MSPI external RAM ECC and SPI CS timing control register
 */
#define SPI_SMEM_C_AC_REG (DR_REG_FLASH_SPI0_BASE + 0x1a0)
/** SPI_SMEM_C_CS_SETUP : HRO; bitpos: [0]; default: 0;
 *  For SPI0 and SPI1, spi cs is enable when spi is in prepare phase. 1: enable 0:
 *  disable.
 */
#define SPI_SMEM_C_CS_SETUP    (BIT(0))
#define SPI_SMEM_C_CS_SETUP_M  (SPI_SMEM_C_CS_SETUP_V << SPI_SMEM_C_CS_SETUP_S)
#define SPI_SMEM_C_CS_SETUP_V  0x00000001U
#define SPI_SMEM_C_CS_SETUP_S  0
/** SPI_SMEM_C_CS_HOLD : HRO; bitpos: [1]; default: 0;
 *  For SPI0 and SPI1, spi cs keep low when spi is in done phase. 1: enable 0: disable.
 */
#define SPI_SMEM_C_CS_HOLD    (BIT(1))
#define SPI_SMEM_C_CS_HOLD_M  (SPI_SMEM_C_CS_HOLD_V << SPI_SMEM_C_CS_HOLD_S)
#define SPI_SMEM_C_CS_HOLD_V  0x00000001U
#define SPI_SMEM_C_CS_HOLD_S  1
/** SPI_SMEM_C_CS_SETUP_TIME : HRO; bitpos: [6:2]; default: 1;
 *  For spi0, (cycles-1) of prepare phase by spi clock this bits are combined with
 *  spi_mem_cs_setup bit.
 */
#define SPI_SMEM_C_CS_SETUP_TIME    0x0000001FU
#define SPI_SMEM_C_CS_SETUP_TIME_M  (SPI_SMEM_C_CS_SETUP_TIME_V << SPI_SMEM_C_CS_SETUP_TIME_S)
#define SPI_SMEM_C_CS_SETUP_TIME_V  0x0000001FU
#define SPI_SMEM_C_CS_SETUP_TIME_S  2
/** SPI_SMEM_C_CS_HOLD_TIME : HRO; bitpos: [11:7]; default: 1;
 *  For SPI0 and SPI1, spi cs signal is delayed to inactive by spi clock this bits are
 *  combined with spi_mem_cs_hold bit.
 */
#define SPI_SMEM_C_CS_HOLD_TIME    0x0000001FU
#define SPI_SMEM_C_CS_HOLD_TIME_M  (SPI_SMEM_C_CS_HOLD_TIME_V << SPI_SMEM_C_CS_HOLD_TIME_S)
#define SPI_SMEM_C_CS_HOLD_TIME_V  0x0000001FU
#define SPI_SMEM_C_CS_HOLD_TIME_S  7
/** SPI_SMEM_C_ECC_CS_HOLD_TIME : HRO; bitpos: [14:12]; default: 3;
 *  SPI_SMEM_C_CS_HOLD_TIME + SPI_SMEM_C_ECC_CS_HOLD_TIME is the SPI0 and SPI1 CS hold
 *  cycles in ECC mode when accessed external RAM.
 */
#define SPI_SMEM_C_ECC_CS_HOLD_TIME    0x00000007U
#define SPI_SMEM_C_ECC_CS_HOLD_TIME_M  (SPI_SMEM_C_ECC_CS_HOLD_TIME_V << SPI_SMEM_C_ECC_CS_HOLD_TIME_S)
#define SPI_SMEM_C_ECC_CS_HOLD_TIME_V  0x00000007U
#define SPI_SMEM_C_ECC_CS_HOLD_TIME_S  12
/** SPI_SMEM_C_ECC_SKIP_PAGE_CORNER : HRO; bitpos: [15]; default: 1;
 *  1: SPI0 skips page corner when accesses external RAM. 0: Not skip page corner when
 *  accesses external RAM.
 */
#define SPI_SMEM_C_ECC_SKIP_PAGE_CORNER    (BIT(15))
#define SPI_SMEM_C_ECC_SKIP_PAGE_CORNER_M  (SPI_SMEM_C_ECC_SKIP_PAGE_CORNER_V << SPI_SMEM_C_ECC_SKIP_PAGE_CORNER_S)
#define SPI_SMEM_C_ECC_SKIP_PAGE_CORNER_V  0x00000001U
#define SPI_SMEM_C_ECC_SKIP_PAGE_CORNER_S  15
/** SPI_SMEM_C_ECC_16TO18_BYTE_EN : HRO; bitpos: [16]; default: 0;
 *  Set this bit to enable SPI0 and SPI1 ECC 16 bytes data with 2 ECC bytes mode when
 *  accesses external RAM.
 */
#define SPI_SMEM_C_ECC_16TO18_BYTE_EN    (BIT(16))
#define SPI_SMEM_C_ECC_16TO18_BYTE_EN_M  (SPI_SMEM_C_ECC_16TO18_BYTE_EN_V << SPI_SMEM_C_ECC_16TO18_BYTE_EN_S)
#define SPI_SMEM_C_ECC_16TO18_BYTE_EN_V  0x00000001U
#define SPI_SMEM_C_ECC_16TO18_BYTE_EN_S  16
/** SPI_SMEM_C_CS_HOLD_DELAY : HRO; bitpos: [30:25]; default: 0;
 *  These bits are used to set the minimum CS high time tSHSL between SPI burst
 *  transfer when accesses to external RAM. tSHSL is (SPI_SMEM_C_CS_HOLD_DELAY[5:0] + 1)
 *  MSPI core clock cycles.
 */
#define SPI_SMEM_C_CS_HOLD_DELAY    0x0000003FU
#define SPI_SMEM_C_CS_HOLD_DELAY_M  (SPI_SMEM_C_CS_HOLD_DELAY_V << SPI_SMEM_C_CS_HOLD_DELAY_S)
#define SPI_SMEM_C_CS_HOLD_DELAY_V  0x0000003FU
#define SPI_SMEM_C_CS_HOLD_DELAY_S  25
/** SPI_SMEM_C_SPLIT_TRANS_EN : HRO; bitpos: [31]; default: 0;
 *  Set this bit to enable SPI0 split one AXI accesses EXT_RAM transfer into two SPI
 *  transfers when one transfer will cross flash/EXT_RAM page corner, valid no matter
 *  whether there is an ECC region or not.
 */
#define SPI_SMEM_C_SPLIT_TRANS_EN    (BIT(31))
#define SPI_SMEM_C_SPLIT_TRANS_EN_M  (SPI_SMEM_C_SPLIT_TRANS_EN_V << SPI_SMEM_C_SPLIT_TRANS_EN_S)
#define SPI_SMEM_C_SPLIT_TRANS_EN_V  0x00000001U
#define SPI_SMEM_C_SPLIT_TRANS_EN_S  31

/** SPI_MEM_C_CLOCK_GATE_REG register
 *  SPI0 clock gate register
 */
#define SPI_MEM_C_CLOCK_GATE_REG (DR_REG_FLASH_SPI0_BASE + 0x200)
/** SPI_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Register clock gate enable signal. 1: Enable. 0: Disable.
 */
#define SPI_CLK_EN    (BIT(0))
#define SPI_CLK_EN_M  (SPI_CLK_EN_V << SPI_CLK_EN_S)
#define SPI_CLK_EN_V  0x00000001U
#define SPI_CLK_EN_S  0
/** SPI_MSPI_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  MSPI lowpower function clock gate force on signal. 1: Enable. 0: Disable.
 */
#define SPI_MSPI_CLK_FORCE_ON    (BIT(1))
#define SPI_MSPI_CLK_FORCE_ON_M  (SPI_MSPI_CLK_FORCE_ON_V << SPI_MSPI_CLK_FORCE_ON_S)
#define SPI_MSPI_CLK_FORCE_ON_V  0x00000001U
#define SPI_MSPI_CLK_FORCE_ON_S  1

/** SPI_MEM_C_NAND_FLASH_EN_REG register
 *  NAND FLASH control register
 */
#define SPI_MEM_C_NAND_FLASH_EN_REG (DR_REG_FLASH_SPI0_BASE + 0x204)
/** SPI_MEM_C_NAND_FLASH_EN : R/W; bitpos: [0]; default: 0;
 *  NAND FLASH function enable signal. 1: Enable NAND FLASH, Disable NOR FLASH. 0:
 *  Disable NAND FLASH, Enable NOR FLASH.
 */
#define SPI_MEM_C_NAND_FLASH_EN    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_EN_M  (SPI_MEM_C_NAND_FLASH_EN_V << SPI_MEM_C_NAND_FLASH_EN_S)
#define SPI_MEM_C_NAND_FLASH_EN_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_EN_S  0
/** SPI_MEM_C_NAND_FLASH_SEQ_HD_INDEX : R/W; bitpos: [15:1]; default: 32767;
 *  NAND FLASH spi seq head index configure register. Every 5 bits represent  the 1st
 *  index of a SPI CMD sequence.[14:10]:usr; [9:5]:axi_rd; [4:0]:axi_wr.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_HD_INDEX    0x00007FFFU
#define SPI_MEM_C_NAND_FLASH_SEQ_HD_INDEX_M  (SPI_MEM_C_NAND_FLASH_SEQ_HD_INDEX_V << SPI_MEM_C_NAND_FLASH_SEQ_HD_INDEX_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_HD_INDEX_V  0x00007FFFU
#define SPI_MEM_C_NAND_FLASH_SEQ_HD_INDEX_S  1
/** SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG : R/W; bitpos: [16]; default: 0;
 *  NAND FLASH spi seq user trigger configure register. SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG
 *  is corresponds to SPI_MEM_C_NAND_FLASH_SEQ_HD_INDEX[14:10].1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG    (BIT(16))
#define SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG_M  (SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG_V << SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_EN : HRO; bitpos: [17]; default: 1;
 *  NAND FLASH spi seq & cmd lut cfg en. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_EN    (BIT(17))
#define SPI_MEM_C_NAND_FLASH_LUT_EN_M  (SPI_MEM_C_NAND_FLASH_LUT_EN_V << SPI_MEM_C_NAND_FLASH_LUT_EN_S)
#define SPI_MEM_C_NAND_FLASH_LUT_EN_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_EN_S  17
/** SPI_MEM_C_NAND_FLASH_SEQ_USR_WEND : R/W; bitpos: [18]; default: 0;
 *  Used with SPI_MEM_C_NAND_FLASH_SEQ_USR_TRIG to indicate the last page program ,and to
 *  execute page execute. 1: write end 0: write in a page size.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_USR_WEND    (BIT(18))
#define SPI_MEM_C_NAND_FLASH_SEQ_USR_WEND_M  (SPI_MEM_C_NAND_FLASH_SEQ_USR_WEND_V << SPI_MEM_C_NAND_FLASH_SEQ_USR_WEND_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_USR_WEND_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_USR_WEND_S  18

