espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SR_ADDR0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SR_ADDR0_REG (DR_REG_FLASH_SPI0_BASE + 0x208)
/** SPI_MEM_C_NAND_FLASH_SR_ADDR0 : R/W; bitpos: [7:0]; default: 0;
 *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
 *  could configure C0H into this register
 */
#define SPI_MEM_C_NAND_FLASH_SR_ADDR0    0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_ADDR0_M  (SPI_MEM_C_NAND_FLASH_SR_ADDR0_V << SPI_MEM_C_NAND_FLASH_SR_ADDR0_S)
#define SPI_MEM_C_NAND_FLASH_SR_ADDR0_V  0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_ADDR0_S  0
/** SPI_MEM_C_NAND_FLASH_SR_ADDR1 : R/W; bitpos: [15:8]; default: 0;
 *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
 *  could configure C0H into this register
 */
#define SPI_MEM_C_NAND_FLASH_SR_ADDR1    0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_ADDR1_M  (SPI_MEM_C_NAND_FLASH_SR_ADDR1_V << SPI_MEM_C_NAND_FLASH_SR_ADDR1_S)
#define SPI_MEM_C_NAND_FLASH_SR_ADDR1_V  0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_ADDR1_S  8
/** SPI_MEM_C_NAND_FLASH_SR_ADDR2 : R/W; bitpos: [23:16]; default: 0;
 *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
 *  could configure C0H into this register
 */
#define SPI_MEM_C_NAND_FLASH_SR_ADDR2    0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_ADDR2_M  (SPI_MEM_C_NAND_FLASH_SR_ADDR2_V << SPI_MEM_C_NAND_FLASH_SR_ADDR2_S)
#define SPI_MEM_C_NAND_FLASH_SR_ADDR2_V  0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_ADDR2_S  16
/** SPI_MEM_C_NAND_FLASH_SR_ADDR3 : R/W; bitpos: [31:24]; default: 0;
 *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
 *  could configure C0H into this register
 */
#define SPI_MEM_C_NAND_FLASH_SR_ADDR3    0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_ADDR3_M  (SPI_MEM_C_NAND_FLASH_SR_ADDR3_V << SPI_MEM_C_NAND_FLASH_SR_ADDR3_S)
#define SPI_MEM_C_NAND_FLASH_SR_ADDR3_V  0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_ADDR3_S  24

/** SPI_MEM_C_NAND_FLASH_SR_DIN0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SR_DIN0_REG (DR_REG_FLASH_SPI0_BASE + 0x20c)
/** SPI_MEM_C_NAND_FLASH_SR_DIN0 : RO; bitpos: [7:0]; default: 0;
 *  spi read state register data to this register for SPI SEQ need.
 *  SPI_MEM_C_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_C_NAND_FLASH_SR_ADDR0_REG.
 */
#define SPI_MEM_C_NAND_FLASH_SR_DIN0    0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_DIN0_M  (SPI_MEM_C_NAND_FLASH_SR_DIN0_V << SPI_MEM_C_NAND_FLASH_SR_DIN0_S)
#define SPI_MEM_C_NAND_FLASH_SR_DIN0_V  0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_DIN0_S  0
/** SPI_MEM_C_NAND_FLASH_SR_DIN1 : RO; bitpos: [15:8]; default: 0;
 *  spi read state register data to this register for SPI SEQ need.
 *  SPI_MEM_C_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_C_NAND_FLASH_SR_ADDR0_REG.
 */
#define SPI_MEM_C_NAND_FLASH_SR_DIN1    0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_DIN1_M  (SPI_MEM_C_NAND_FLASH_SR_DIN1_V << SPI_MEM_C_NAND_FLASH_SR_DIN1_S)
#define SPI_MEM_C_NAND_FLASH_SR_DIN1_V  0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_DIN1_S  8
/** SPI_MEM_C_NAND_FLASH_SR_DIN2 : RO; bitpos: [23:16]; default: 0;
 *  spi read state register data to this register for SPI SEQ need.
 *  SPI_MEM_C_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_C_NAND_FLASH_SR_ADDR0_REG.
 */
#define SPI_MEM_C_NAND_FLASH_SR_DIN2    0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_DIN2_M  (SPI_MEM_C_NAND_FLASH_SR_DIN2_V << SPI_MEM_C_NAND_FLASH_SR_DIN2_S)
#define SPI_MEM_C_NAND_FLASH_SR_DIN2_V  0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_DIN2_S  16
/** SPI_MEM_C_NAND_FLASH_SR_DIN3 : RO; bitpos: [31:24]; default: 0;
 *  spi read state register data to this register for SPI SEQ need.
 *  SPI_MEM_C_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_C_NAND_FLASH_SR_ADDR0_REG.
 */
#define SPI_MEM_C_NAND_FLASH_SR_DIN3    0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_DIN3_M  (SPI_MEM_C_NAND_FLASH_SR_DIN3_V << SPI_MEM_C_NAND_FLASH_SR_DIN3_S)
#define SPI_MEM_C_NAND_FLASH_SR_DIN3_V  0x000000FFU
#define SPI_MEM_C_NAND_FLASH_SR_DIN3_S  24

/** SPI_MEM_C_NAND_FLASH_CFG_DATA0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA0_REG (DR_REG_FLASH_SPI0_BASE + 0x210)
/** SPI_MEM_C_NAND_FLASH_CFG_DATA0 : R/W; bitpos: [15:0]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA0    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA0_M  (SPI_MEM_C_NAND_FLASH_CFG_DATA0_V << SPI_MEM_C_NAND_FLASH_CFG_DATA0_S)
#define SPI_MEM_C_NAND_FLASH_CFG_DATA0_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA0_S  0
/** SPI_MEM_C_NAND_FLASH_CFG_DATA1 : R/W; bitpos: [31:16]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA1    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA1_M  (SPI_MEM_C_NAND_FLASH_CFG_DATA1_V << SPI_MEM_C_NAND_FLASH_CFG_DATA1_S)
#define SPI_MEM_C_NAND_FLASH_CFG_DATA1_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA1_S  16

/** SPI_MEM_C_NAND_FLASH_CFG_DATA1_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA1_REG (DR_REG_FLASH_SPI0_BASE + 0x214)
/** SPI_MEM_C_NAND_FLASH_CFG_DATA2 : R/W; bitpos: [15:0]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA2    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA2_M  (SPI_MEM_C_NAND_FLASH_CFG_DATA2_V << SPI_MEM_C_NAND_FLASH_CFG_DATA2_S)
#define SPI_MEM_C_NAND_FLASH_CFG_DATA2_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA2_S  0
/** SPI_MEM_C_NAND_FLASH_CFG_DATA3 : R/W; bitpos: [31:16]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA3    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA3_M  (SPI_MEM_C_NAND_FLASH_CFG_DATA3_V << SPI_MEM_C_NAND_FLASH_CFG_DATA3_S)
#define SPI_MEM_C_NAND_FLASH_CFG_DATA3_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA3_S  16

