espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_CFG_DATA2_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA2_REG (DR_REG_FLASH_SPI0_BASE + 0x218)
/** SPI_MEM_C_NAND_FLASH_CFG_DATA4 : R/W; bitpos: [15:0]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA4    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA4_M  (SPI_MEM_C_NAND_FLASH_CFG_DATA4_V << SPI_MEM_C_NAND_FLASH_CFG_DATA4_S)
#define SPI_MEM_C_NAND_FLASH_CFG_DATA4_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA4_S  0
/** SPI_MEM_C_NAND_FLASH_CFG_DATA5 : R/W; bitpos: [31:16]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_C_NAND_FLASH_CFG_DATA5    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA5_M  (SPI_MEM_C_NAND_FLASH_CFG_DATA5_V << SPI_MEM_C_NAND_FLASH_CFG_DATA5_S)
#define SPI_MEM_C_NAND_FLASH_CFG_DATA5_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_CFG_DATA5_S  16

/** SPI_MEM_C_NAND_FLASH_CMD_LUT0_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT0_REG (DR_REG_FLASH_SPI0_BASE + 0x240)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE0 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 0.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE0    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE0_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE0_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE0_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE0_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE0_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN0 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 0.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN0    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN0_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN0_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN0_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN0_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN0_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN0 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 0.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN0    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN0_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN0_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN0_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN0_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN0_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN0 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 0.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN0    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN0_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN0_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN0_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN0_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN0_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN0 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 0.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN0    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN0_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN0_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN0_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN0_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN0_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN0 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 0,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT0_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN0    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN0_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN0_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN0_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN0_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN0_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT1_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT1_REG (DR_REG_FLASH_SPI0_BASE + 0x244)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE1 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 1.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE1    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE1_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE1_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE1_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE1_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE1_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN1 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 1.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN1    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN1_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN1_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN1_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN1_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN1_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN1 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 1.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN1    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN1_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN1_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN1_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN1_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN1_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN1 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 1.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN1    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN1_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN1_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN1_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN1_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN1_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN1 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 1.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN1    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN1_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN1_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN1_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN1_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN1_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN1 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 1,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT1_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN1    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN1_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN1_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN1_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN1_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN1_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT2_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT2_REG (DR_REG_FLASH_SPI0_BASE + 0x248)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE2 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 2.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE2    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE2_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE2_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE2_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE2_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE2_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN2 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 2.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN2    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN2_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN2_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN2_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN2_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN2_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN2 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 2.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN2    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN2_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN2_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN2_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN2_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN2_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN2 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 2.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN2    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN2_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN2_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN2_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN2_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN2_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN2 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 2.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN2    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN2_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN2_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN2_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN2_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN2_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN2 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 2,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT2_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN2    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN2_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN2_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN2_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN2_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN2_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT3_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT3_REG (DR_REG_FLASH_SPI0_BASE + 0x24c)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE3 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 3.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE3    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE3_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE3_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE3_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE3_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE3_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN3 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 3.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN3    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN3_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN3_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN3_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN3_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN3_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN3 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 3.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN3    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN3_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN3_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN3_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN3_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN3_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN3 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 3.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN3    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN3_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN3_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN3_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN3_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN3_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN3 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 3.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN3    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN3_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN3_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN3_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN3_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN3_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN3 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 3,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT3_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN3    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN3_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN3_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN3_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN3_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN3_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT4_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT4_REG (DR_REG_FLASH_SPI0_BASE + 0x250)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE4 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 4.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE4    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE4_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE4_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE4_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE4_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE4_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN4 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 4.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN4    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN4_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN4_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN4_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN4_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN4_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN4 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 4.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN4    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN4_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN4_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN4_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN4_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN4_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN4 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 4.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN4    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN4_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN4_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN4_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN4_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN4_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN4 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 4.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN4    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN4_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN4_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN4_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN4_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN4_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN4 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 4,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT4_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN4    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN4_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN4_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN4_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN4_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN4_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT5_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT5_REG (DR_REG_FLASH_SPI0_BASE + 0x254)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE5 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 5.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE5    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE5_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE5_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE5_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE5_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE5_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN5 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 5.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN5    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN5_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN5_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN5_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN5_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN5_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN5 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 5.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN5    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN5_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN5_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN5_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN5_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN5_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN5 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 5.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN5    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN5_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN5_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN5_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN5_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN5_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN5 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 5.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN5    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN5_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN5_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN5_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN5_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN5_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN5 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 5,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT5_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN5    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN5_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN5_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN5_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN5_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN5_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT6_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT6_REG (DR_REG_FLASH_SPI0_BASE + 0x258)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE6 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 6.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE6    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE6_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE6_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE6_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE6_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE6_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN6 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 6.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN6    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN6_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN6_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN6_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN6_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN6_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN6 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 6.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN6    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN6_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN6_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN6_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN6_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN6_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN6 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 6.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN6    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN6_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN6_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN6_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN6_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN6_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN6 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 6.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN6    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN6_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN6_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN6_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN6_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN6_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN6 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 6,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT6_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN6    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN6_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN6_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN6_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN6_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN6_S  30

