espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_CMD_LUT7_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT7_REG (DR_REG_FLASH_SPI0_BASE + 0x25c)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE7 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 7.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE7    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE7_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE7_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE7_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE7_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE7_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN7 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 7.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN7    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN7_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN7_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN7_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN7_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN7_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN7 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 7.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN7    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN7_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN7_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN7_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN7_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN7_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN7 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 7.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN7    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN7_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN7_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN7_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN7_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN7_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN7 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 7.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN7    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN7_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN7_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN7_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN7_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN7_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN7 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 7,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT7_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN7    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN7_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN7_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN7_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN7_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN7_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT8_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT8_REG (DR_REG_FLASH_SPI0_BASE + 0x260)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE8 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 8.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE8    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE8_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE8_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE8_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE8_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE8_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN8 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 8.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN8    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN8_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN8_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN8_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN8_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN8_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN8 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 8.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN8    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN8_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN8_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN8_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN8_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN8_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN8 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 8.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN8    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN8_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN8_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN8_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN8_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN8_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN8 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 8.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN8    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN8_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN8_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN8_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN8_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN8_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN8 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 8,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT8_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN8    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN8_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN8_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN8_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN8_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN8_S  30

