espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_CMD_LUT9_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT9_REG (DR_REG_FLASH_SPI0_BASE + 0x264)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE9 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 9.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE9    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE9_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE9_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE9_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE9_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE9_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN9 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 9.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN9    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN9_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN9_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN9_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN9_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN9_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN9 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 9.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN9    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN9_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN9_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN9_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN9_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN9_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN9 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 9.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN9    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN9_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN9_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN9_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN9_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN9_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN9 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 9.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN9    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN9_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN9_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN9_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN9_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN9_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN9 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 9,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_C_NAND_FLASH_CMD_LUT9_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN9    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN9_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN9_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN9_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN9_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN9_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT10_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT10_REG (DR_REG_FLASH_SPI0_BASE + 0x268)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE10 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 10.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE10    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE10_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE10_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE10_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE10_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE10_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN10 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 10.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN10    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN10_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN10_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN10_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN10_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN10_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN10 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 10.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN10    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN10_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN10_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN10_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN10_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN10_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN10 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 10.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN10    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN10_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN10_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN10_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN10_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN10_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN10 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 10.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN10    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN10_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN10_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN10_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN10_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN10_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN10 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 10,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_CMD_LUT10_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN10    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN10_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN10_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN10_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN10_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN10_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT11_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT11_REG (DR_REG_FLASH_SPI0_BASE + 0x26c)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE11 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 11.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE11    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE11_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE11_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE11_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE11_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE11_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN11 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 11.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN11    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN11_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN11_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN11_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN11_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN11_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN11 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 11.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN11    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN11_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN11_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN11_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN11_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN11_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN11 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 11.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN11    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN11_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN11_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN11_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN11_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN11_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN11 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 11.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN11    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN11_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN11_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN11_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN11_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN11_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN11 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 11,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_CMD_LUT11_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN11    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN11_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN11_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN11_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN11_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN11_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT12_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT12_REG (DR_REG_FLASH_SPI0_BASE + 0x270)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE12 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 12.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE12    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE12_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE12_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE12_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE12_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE12_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN12 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 12.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN12    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN12_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN12_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN12_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN12_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN12_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN12 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 12.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN12    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN12_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN12_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN12_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN12_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN12_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN12 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 12.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN12    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN12_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN12_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN12_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN12_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN12_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN12 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 12.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN12    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN12_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN12_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN12_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN12_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN12_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN12 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 12,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_CMD_LUT12_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN12    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN12_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN12_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN12_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN12_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN12_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT13_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT13_REG (DR_REG_FLASH_SPI0_BASE + 0x274)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE13 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 13.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE13    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE13_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE13_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE13_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE13_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE13_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN13 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 13.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN13    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN13_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN13_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN13_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN13_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN13_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN13 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 13.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN13    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN13_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN13_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN13_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN13_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN13_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN13 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 13.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN13    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN13_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN13_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN13_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN13_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN13_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN13 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 13.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN13    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN13_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN13_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN13_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN13_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN13_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN13 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 13,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_CMD_LUT13_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN13    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN13_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN13_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN13_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN13_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN13_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT14_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT14_REG (DR_REG_FLASH_SPI0_BASE + 0x278)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE14 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 14.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE14    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE14_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE14_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE14_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE14_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE14_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN14 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 14.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN14    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN14_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN14_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN14_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN14_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN14_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN14 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 14.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN14    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN14_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN14_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN14_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN14_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN14_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN14 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 14.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN14    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN14_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN14_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN14_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN14_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN14_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN14 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 14.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN14    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN14_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN14_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN14_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN14_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN14_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN14 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 14,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_CMD_LUT14_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN14    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN14_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN14_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN14_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN14_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN14_S  30

/** SPI_MEM_C_NAND_FLASH_CMD_LUT15_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_C_NAND_FLASH_CMD_LUT15_REG (DR_REG_FLASH_SPI0_BASE + 0x27c)
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE15 : R/W; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 15.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE15    0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE15_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE15_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE15_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE15_V  0x0000FFFFU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_VALUE15_S  0
/** SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN15 : R/W; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 15.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN15    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN15_M  (SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN15_V << SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN15_S)
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN15_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_SFSM_ST_EN15_S  16
/** SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN15 : R/W; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 15.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN15    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN15_M  (SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN15_V << SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN15_S)
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN15_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_CMD_LEN15_S  20
/** SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN15 : R/W; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 15.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN15    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN15_M  (SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN15_V << SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN15_S)
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN15_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_LUT_ADDR_LEN15_S  24
/** SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN15 : R/W; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 15.
 */
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN15    0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN15_M  (SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN15_V << SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN15_S)
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN15_V  0x00000003U
#define SPI_MEM_C_NAND_FLASH_LUT_DATA_LEN15_S  28
/** SPI_MEM_C_NAND_FLASH_LUT_BUS_EN15 : R/W; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 15,SPI could use DUAL/QUAD
 *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
 *  0:Disable.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_CMD_LUT15_REG's field. The number of CMD LUT entries can be
 *  defined by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN15    (BIT(30))
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN15_M  (SPI_MEM_C_NAND_FLASH_LUT_BUS_EN15_V << SPI_MEM_C_NAND_FLASH_LUT_BUS_EN15_S)
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN15_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_LUT_BUS_EN15_S  30

