espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SPI_SEQ0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ0_REG (DR_REG_FLASH_SPI0_BASE + 0x280)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG0 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG0    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG0_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG0_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG0_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG0_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG0_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN0 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN0    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN0_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN0_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN0_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN0_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN0_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX0 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 0.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX0    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX0_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX0_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX0_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX0_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX0_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX0 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 0.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX0    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX0_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX0_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX0_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX0_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX0_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG0 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG0    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG0_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG0_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG0_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG0_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG0_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX0 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX0    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX0_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX0_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX0_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX0_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX0_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ1_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ1_REG (DR_REG_FLASH_SPI0_BASE + 0x284)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG1 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 1.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG1    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG1_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG1_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG1_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG1_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG1_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN1 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 1. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN1    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN1_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN1_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN1_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN1_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN1_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX1 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 1.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX1    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX1_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX1_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX1_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX1_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX1_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX1 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 1.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX1    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX1_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX1_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX1_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX1_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX1_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG1 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 1. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG1    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG1_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG1_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG1_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG1_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG1_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX1 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 1. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX1    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX1_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX1_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX1_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX1_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX1_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ2_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ2_REG (DR_REG_FLASH_SPI0_BASE + 0x288)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG2 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 2.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG2    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG2_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG2_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG2_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG2_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG2_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN2 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 2. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN2    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN2_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN2_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN2_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN2_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN2_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX2 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 2.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX2    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX2_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX2_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX2_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX2_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX2_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX2 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 2.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX2    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX2_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX2_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX2_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX2_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX2_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG2 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 2. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG2    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG2_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG2_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG2_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG2_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG2_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX2 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 2. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX2    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX2_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX2_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX2_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX2_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX2_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ3_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ3_REG (DR_REG_FLASH_SPI0_BASE + 0x28c)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG3 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 3.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG3    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG3_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG3_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG3_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG3_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG3_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN3 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 3. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN3    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN3_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN3_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN3_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN3_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN3_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX3 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 3.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX3    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX3_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX3_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX3_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX3_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX3_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX3 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 3.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX3    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX3_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX3_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX3_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX3_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX3_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG3 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 3. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG3    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG3_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG3_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG3_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG3_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG3_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX3 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 3. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX3    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX3_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX3_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX3_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX3_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX3_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ4_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ4_REG (DR_REG_FLASH_SPI0_BASE + 0x290)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG4 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 4.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG4    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG4_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG4_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG4_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG4_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG4_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN4 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 4. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN4    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN4_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN4_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN4_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN4_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN4_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX4 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 4.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX4    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX4_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX4_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX4_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX4_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX4_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX4 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 4.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX4    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX4_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX4_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX4_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX4_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX4_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG4 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 4. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG4    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG4_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG4_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG4_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG4_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG4_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX4 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 4. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX4    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX4_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX4_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX4_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX4_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX4_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ5_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ5_REG (DR_REG_FLASH_SPI0_BASE + 0x294)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG5 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 5.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG5    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG5_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG5_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG5_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG5_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG5_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN5 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 5. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN5    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN5_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN5_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN5_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN5_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN5_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX5 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 5.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX5    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX5_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX5_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX5_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX5_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX5_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX5 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 5.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX5    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX5_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX5_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX5_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX5_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX5_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG5 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 5. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG5    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG5_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG5_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG5_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG5_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG5_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX5 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 5. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX5    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX5_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX5_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX5_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX5_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX5_S  11

