espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SPI_SEQ6_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ6_REG (DR_REG_FLASH_SPI0_BASE + 0x298)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG6 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 6.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG6    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG6_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG6_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG6_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG6_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG6_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN6 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 6. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN6    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN6_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN6_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN6_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN6_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN6_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX6 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 6.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX6    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX6_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX6_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX6_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX6_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX6_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX6 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 6.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX6    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX6_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX6_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX6_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX6_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX6_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG6 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 6. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG6    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG6_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG6_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG6_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG6_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG6_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX6 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 6. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX6    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX6_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX6_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX6_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX6_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX6_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ7_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ7_REG (DR_REG_FLASH_SPI0_BASE + 0x29c)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG7 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 7.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG7    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG7_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG7_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG7_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG7_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG7_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN7 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 7. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN7    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN7_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN7_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN7_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN7_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN7_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX7 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 7.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX7    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX7_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX7_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX7_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX7_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX7_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX7 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 7.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX7    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX7_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX7_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX7_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX7_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX7_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG7 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 7. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG7    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG7_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG7_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG7_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG7_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG7_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX7 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 7. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX7    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX7_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX7_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX7_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX7_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX7_S  11

