espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SPI_SEQ8_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ8_REG (DR_REG_FLASH_SPI0_BASE + 0x2a0)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG8 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 8.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG8    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG8_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG8_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG8_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG8_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG8_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN8 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 8. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN8    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN8_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN8_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN8_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN8_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN8_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX8 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 8.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX8    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX8_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX8_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX8_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX8_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX8_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX8 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 8.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX8    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX8_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX8_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX8_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX8_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX8_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG8 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 8. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG8    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG8_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG8_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG8_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG8_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG8_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX8 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 8. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX8    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX8_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX8_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX8_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX8_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX8_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ9_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ9_REG (DR_REG_FLASH_SPI0_BASE + 0x2a4)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG9 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 9.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG9    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG9_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG9_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG9_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG9_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG9_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN9 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 9. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN9    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN9_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN9_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN9_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN9_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN9_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX9 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 9.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX9    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX9_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX9_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX9_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX9_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX9_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX9 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 9.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX9    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX9_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX9_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX9_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX9_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX9_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG9 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 9. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG9    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG9_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG9_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG9_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG9_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG9_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX9 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 9. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX9    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX9_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX9_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX9_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX9_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX9_S  11

