espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SPI_SEQ10_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ10_REG (DR_REG_FLASH_SPI0_BASE + 0x2a8)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG10 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 10.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG10    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG10_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG10_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG10_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG10_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG10_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN10 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 10. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN10    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN10_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN10_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN10_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN10_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN10_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX10 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 10.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX10    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX10_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX10_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX10_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX10_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX10_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX10 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 10.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX10    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX10_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX10_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX10_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX10_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX10_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG10 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 10. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG10    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG10_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG10_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG10_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG10_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG10_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX10 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 10. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX10    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX10_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX10_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX10_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX10_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX10_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ11_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ11_REG (DR_REG_FLASH_SPI0_BASE + 0x2ac)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG11 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 11.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG11    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG11_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG11_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG11_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG11_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG11_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN11 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 11. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN11    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN11_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN11_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN11_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN11_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN11_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX11 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 11.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX11    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX11_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX11_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX11_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX11_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX11_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX11 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 11.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX11    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX11_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX11_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX11_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX11_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX11_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG11 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 11. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG11    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG11_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG11_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG11_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG11_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG11_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX11 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 11. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX11    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX11_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX11_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX11_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX11_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX11_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ12_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ12_REG (DR_REG_FLASH_SPI0_BASE + 0x2b0)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG12 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 12.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG12    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG12_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG12_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG12_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG12_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG12_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN12 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 12. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN12    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN12_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN12_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN12_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN12_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN12_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX12 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 12.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX12    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX12_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX12_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX12_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX12_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX12_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX12 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 12.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX12    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX12_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX12_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX12_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX12_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX12_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG12 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 12. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG12    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG12_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG12_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG12_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG12_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG12_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX12 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 12. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX12    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX12_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX12_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX12_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX12_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX12_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ13_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ13_REG (DR_REG_FLASH_SPI0_BASE + 0x2b4)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG13 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 13.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG13    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG13_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG13_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG13_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG13_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG13_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN13 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 13. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN13    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN13_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN13_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN13_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN13_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN13_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX13 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 13.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX13    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX13_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX13_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX13_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX13_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX13_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX13 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 13.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX13    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX13_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX13_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX13_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX13_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX13_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG13 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 13. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG13    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG13_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG13_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG13_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG13_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG13_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX13 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 13. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX13    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX13_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX13_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX13_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX13_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX13_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ14_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ14_REG (DR_REG_FLASH_SPI0_BASE + 0x2b8)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG14 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 14.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG14    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG14_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG14_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG14_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG14_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG14_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN14 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 14. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN14    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN14_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN14_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN14_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN14_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN14_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX14 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 14.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX14    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX14_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX14_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX14_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX14_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX14_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX14 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 14.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX14    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX14_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX14_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX14_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX14_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX14_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG14 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 14. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG14    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG14_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG14_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG14_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG14_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG14_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX14 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 14. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX14    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX14_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX14_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX14_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX14_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX14_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ15_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ15_REG (DR_REG_FLASH_SPI0_BASE + 0x2bc)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG15 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 15.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG15    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG15_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG15_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG15_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG15_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG15_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN15 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 15. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN15    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN15_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN15_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN15_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN15_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN15_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX15 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 15.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX15    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX15_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX15_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX15_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX15_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX15_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX15 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 15.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX15    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX15_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX15_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX15_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX15_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX15_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG15 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 15. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG15    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG15_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG15_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG15_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG15_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG15_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX15 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 15. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX15    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX15_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX15_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX15_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX15_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX15_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ16_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ16_REG (DR_REG_FLASH_SPI0_BASE + 0x2c0)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG16 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 16.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG16    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG16_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG16_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG16_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG16_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG16_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN16 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 16. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN16    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN16_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN16_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN16_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN16_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN16_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX16 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 16.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX16    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX16_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX16_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX16_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX16_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX16_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX16 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 16.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX16    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX16_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX16_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX16_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX16_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX16_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG16 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 16. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG16    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG16_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG16_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG16_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG16_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG16_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX16 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 16. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX16    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX16_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX16_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX16_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX16_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX16_S  11

