espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SPI_SEQ17_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ17_REG (DR_REG_FLASH_SPI0_BASE + 0x2c4)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG17 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 17.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG17    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG17_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG17_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG17_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG17_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG17_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN17 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 17. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN17    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN17_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN17_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN17_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN17_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN17_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX17 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 17.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX17    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX17_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX17_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX17_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX17_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX17_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX17 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 17.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX17    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX17_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX17_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX17_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX17_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX17_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG17 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 17. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG17    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG17_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG17_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG17_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG17_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG17_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX17 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 17. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX17    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX17_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX17_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX17_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX17_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX17_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ18_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ18_REG (DR_REG_FLASH_SPI0_BASE + 0x2c8)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG18 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 18.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG18    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG18_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG18_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG18_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG18_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG18_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN18 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 18. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN18    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN18_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN18_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN18_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN18_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN18_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX18 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 18.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX18    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX18_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX18_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX18_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX18_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX18_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX18 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 18.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX18    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX18_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX18_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX18_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX18_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX18_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG18 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 18. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG18    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG18_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG18_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG18_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG18_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG18_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX18 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 18. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX18    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX18_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX18_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX18_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX18_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX18_S  11

