espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SPI_SEQ19_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ19_REG (DR_REG_FLASH_SPI0_BASE + 0x2cc)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG19 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 19.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG19    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG19_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG19_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG19_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG19_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG19_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN19 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 19. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN19    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN19_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN19_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN19_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN19_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN19_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX19 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 19.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX19    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX19_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX19_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX19_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX19_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX19_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX19 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 19.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX19    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX19_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX19_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX19_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX19_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX19_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG19 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 19. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG19    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG19_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG19_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG19_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG19_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG19_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX19 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 19. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX19    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX19_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX19_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX19_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX19_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX19_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ20_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ20_REG (DR_REG_FLASH_SPI0_BASE + 0x2d0)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG20 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 20.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG20    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG20_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG20_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG20_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG20_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG20_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN20 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 20. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN20    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN20_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN20_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN20_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN20_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN20_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX20 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 20.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX20    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX20_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX20_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX20_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX20_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX20_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX20 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 20.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX20    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX20_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX20_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX20_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX20_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX20_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG20 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 20. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG20    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG20_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG20_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG20_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG20_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG20_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX20 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 20. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX20    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX20_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX20_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX20_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX20_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX20_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ21_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ21_REG (DR_REG_FLASH_SPI0_BASE + 0x2d4)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG21 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 21.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG21    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG21_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG21_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG21_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG21_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG21_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN21 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 21. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN21    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN21_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN21_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN21_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN21_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN21_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX21 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 21.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX21    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX21_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX21_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX21_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX21_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX21_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX21 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 21.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX21    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX21_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX21_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX21_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX21_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX21_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG21 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 21. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG21    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG21_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG21_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG21_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG21_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG21_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX21 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 21. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX21    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX21_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX21_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX21_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX21_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX21_S  11

