espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SPI_SEQ22_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ22_REG (DR_REG_FLASH_SPI0_BASE + 0x2d8)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG22 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 22.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG22    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG22_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG22_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG22_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG22_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG22_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN22 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 22. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN22    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN22_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN22_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN22_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN22_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN22_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX22 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 22.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX22    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX22_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX22_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX22_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX22_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX22_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX22 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 22.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX22    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX22_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX22_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX22_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX22_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX22_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG22 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 22. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG22    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG22_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG22_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG22_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG22_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG22_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX22 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 22. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX22    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX22_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX22_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX22_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX22_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX22_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ23_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ23_REG (DR_REG_FLASH_SPI0_BASE + 0x2dc)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG23 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 23.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG23    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG23_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG23_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG23_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG23_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG23_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN23 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 23. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN23    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN23_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN23_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN23_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN23_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN23_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX23 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 23.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX23    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX23_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX23_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX23_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX23_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX23_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX23 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 23.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX23    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX23_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX23_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX23_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX23_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX23_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG23 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 23. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG23    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG23_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG23_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG23_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG23_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG23_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX23 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 23. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX23    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX23_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX23_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX23_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX23_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX23_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ24_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ24_REG (DR_REG_FLASH_SPI0_BASE + 0x2e0)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG24 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 24.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG24    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG24_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG24_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG24_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG24_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG24_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN24 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 24. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN24    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN24_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN24_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN24_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN24_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN24_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX24 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 24.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX24    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX24_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX24_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX24_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX24_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX24_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX24 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 24.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX24    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX24_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX24_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX24_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX24_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX24_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG24 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 24. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG24    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG24_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG24_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG24_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG24_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG24_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX24 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 24. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX24    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX24_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX24_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX24_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX24_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX24_S  11

