espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_reg.h
/** SPI_MEM_C_NAND_FLASH_SPI_SEQ25_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ25_REG (DR_REG_FLASH_SPI0_BASE + 0x2e4)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG25 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 25.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG25    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG25_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG25_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG25_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG25_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG25_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN25 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 25. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN25    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN25_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN25_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN25_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN25_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN25_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX25 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 25.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX25    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX25_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX25_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX25_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX25_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX25_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX25 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 25.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX25    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX25_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX25_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX25_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX25_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX25_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG25 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 25. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG25    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG25_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG25_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG25_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG25_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG25_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX25 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 25. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX25    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX25_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX25_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX25_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX25_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX25_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ26_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ26_REG (DR_REG_FLASH_SPI0_BASE + 0x2e8)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG26 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 26.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG26    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG26_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG26_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG26_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG26_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG26_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN26 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 26. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN26    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN26_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN26_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN26_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN26_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN26_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX26 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 26.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX26    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX26_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX26_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX26_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX26_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX26_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX26 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 26.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX26    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX26_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX26_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX26_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX26_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX26_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG26 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 26. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG26    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG26_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG26_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG26_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG26_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG26_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX26 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 26. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX26    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX26_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX26_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX26_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX26_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX26_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ27_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ27_REG (DR_REG_FLASH_SPI0_BASE + 0x2ec)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG27 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 27.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG27    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG27_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG27_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG27_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG27_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG27_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN27 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 27. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN27    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN27_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN27_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN27_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN27_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN27_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX27 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 27.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX27    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX27_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX27_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX27_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX27_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX27_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX27 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 27.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX27    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX27_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX27_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX27_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX27_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX27_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG27 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 27. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG27    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG27_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG27_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG27_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG27_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG27_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX27 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 27. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX27    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX27_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX27_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX27_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX27_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX27_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ28_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ28_REG (DR_REG_FLASH_SPI0_BASE + 0x2f0)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG28 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 28.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG28    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG28_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG28_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG28_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG28_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG28_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN28 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 28. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN28    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN28_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN28_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN28_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN28_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN28_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX28 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 28.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX28    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX28_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX28_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX28_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX28_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX28_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX28 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 28.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX28    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX28_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX28_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX28_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX28_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX28_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG28 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 28. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG28    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG28_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG28_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG28_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG28_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG28_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX28 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 28. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX28    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX28_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX28_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX28_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX28_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX28_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ29_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ29_REG (DR_REG_FLASH_SPI0_BASE + 0x2f4)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG29 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 29.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG29    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG29_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG29_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG29_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG29_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG29_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN29 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 29. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN29    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN29_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN29_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN29_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN29_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN29_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX29 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 29.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX29    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX29_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX29_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX29_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX29_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX29_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX29 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 29.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX29    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX29_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX29_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX29_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX29_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX29_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG29 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 29. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG29    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG29_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG29_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG29_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG29_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG29_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX29 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 29. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX29    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX29_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX29_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX29_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX29_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX29_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ30_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ30_REG (DR_REG_FLASH_SPI0_BASE + 0x2f8)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG30 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 30.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG30    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG30_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG30_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG30_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG30_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG30_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN30 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 30. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN30    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN30_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN30_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN30_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN30_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN30_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX30 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 30.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX30    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX30_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX30_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX30_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX30_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX30_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX30 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 30.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX30    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX30_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX30_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX30_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX30_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX30_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG30 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 30. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG30    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG30_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG30_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG30_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG30_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG30_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX30 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 30. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX30    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX30_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX30_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX30_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX30_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX30_S  11

/** SPI_MEM_C_NAND_FLASH_SPI_SEQ31_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_C_NAND_FLASH_SPI_SEQ31_REG (DR_REG_FLASH_SPI0_BASE + 0x2fc)
/** SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG31 : R/W; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 31.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG31    (BIT(0))
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG31_M  (SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG31_V << SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG31_S)
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG31_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SEQ_TAIL_FLG31_S  0
/** SPI_MEM_C_NAND_FLASH_SR_CHK_EN31 : R/W; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 31. 1: enable 0: disable.
 */
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN31    (BIT(1))
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN31_M  (SPI_MEM_C_NAND_FLASH_SR_CHK_EN31_V << SPI_MEM_C_NAND_FLASH_SR_CHK_EN31_S)
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN31_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_SR_CHK_EN31_S  1
/** SPI_MEM_C_NAND_FLASH_DIN_INDEX31 : R/W; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 31.  Use with
 *  SPI_MEM_C_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX31    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX31_M  (SPI_MEM_C_NAND_FLASH_DIN_INDEX31_V << SPI_MEM_C_NAND_FLASH_DIN_INDEX31_S)
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX31_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_DIN_INDEX31_S  2
/** SPI_MEM_C_NAND_FLASH_ADDR_INDEX31 : R/W; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 31.  Use with
 *  SPI_MEM_C_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX31    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX31_M  (SPI_MEM_C_NAND_FLASH_ADDR_INDEX31_V << SPI_MEM_C_NAND_FLASH_ADDR_INDEX31_S)
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX31_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_ADDR_INDEX31_S  6
/** SPI_MEM_C_NAND_FLASH_REQ_OR_CFG31 : R/W; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 31. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG31    (BIT(10))
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG31_M  (SPI_MEM_C_NAND_FLASH_REQ_OR_CFG31_V << SPI_MEM_C_NAND_FLASH_REQ_OR_CFG31_S)
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG31_V  0x00000001U
#define SPI_MEM_C_NAND_FLASH_REQ_OR_CFG31_S  10
/** SPI_MEM_C_NAND_FLASH_CMD_INDEX31 : R/W; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 31. Use to find SPI command
 *  in CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_C_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX31    0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX31_M  (SPI_MEM_C_NAND_FLASH_CMD_INDEX31_V << SPI_MEM_C_NAND_FLASH_CMD_INDEX31_S)
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX31_V  0x0000000FU
#define SPI_MEM_C_NAND_FLASH_CMD_INDEX31_S  11

/** SPI_MEM_C_XTS_PLAIN_BASE_REG register
 *  The base address of the memory that stores plaintext in Manual Encryption
 */
#define SPI_MEM_C_XTS_PLAIN_BASE_REG (DR_REG_FLASH_SPI0_BASE + 0x300)
/** SPI_XTS_PLAIN : R/W; bitpos: [31:0]; default: 0;
 *  This field is only used to generate include file in c case. This field is useless.
 *  Please do not use this field.
 */
#define SPI_XTS_PLAIN    0xFFFFFFFFU
#define SPI_XTS_PLAIN_M  (SPI_XTS_PLAIN_V << SPI_XTS_PLAIN_S)
#define SPI_XTS_PLAIN_V  0xFFFFFFFFU
#define SPI_XTS_PLAIN_S  0

/** SPI_MEM_C_XTS_LINESIZE_REG register
 *  Manual Encryption Line-Size register
 */
#define SPI_MEM_C_XTS_LINESIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x340)
/** SPI_XTS_LINESIZE : R/W; bitpos: [1:0]; default: 0;
 *  This bits stores the line-size parameter which will be used in manual encryption
 *  calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1:
 *  32-bytes, 2: 64-bytes, 3:reserved.
 */
#define SPI_XTS_LINESIZE    0x00000003U
#define SPI_XTS_LINESIZE_M  (SPI_XTS_LINESIZE_V << SPI_XTS_LINESIZE_S)
#define SPI_XTS_LINESIZE_V  0x00000003U
#define SPI_XTS_LINESIZE_S  0

/** SPI_MEM_C_XTS_DESTINATION_REG register
 *  Manual Encryption destination register
 */
#define SPI_MEM_C_XTS_DESTINATION_REG (DR_REG_FLASH_SPI0_BASE + 0x344)
/** SPI_XTS_DESTINATION : R/W; bitpos: [0]; default: 0;
 *  This bit stores the destination parameter which will be used in manual encryption
 *  calculation. 0: flash(default), 1: psram(reserved). Only default value can be used.
 */
#define SPI_XTS_DESTINATION    (BIT(0))
#define SPI_XTS_DESTINATION_M  (SPI_XTS_DESTINATION_V << SPI_XTS_DESTINATION_S)
#define SPI_XTS_DESTINATION_V  0x00000001U
#define SPI_XTS_DESTINATION_S  0

